Root-cern-repl.org
#+INCLUDE: theme/style.org
#+TITLE: CPP / C++ Review
#+DESCRIPTION: cpp c++ interactive scripting with C++ on CERN's ROOT REPL or CLING.
#+STARTUP: content 

* C++ CPP CERN - Root Cling Interpreter and tools
** Overview 

[[https://en.wikipedia.org/wiki/CERN][CERN]]'s (European Organization for Nuclear Research) [[https://en.wikipedia.org/wiki/ROOT][Root Framework]]
allows one to explore and play with C++ interactively through an
interactive C++ interpreter where the user can type and evaluate
expressions and commands in a similar way to Python's REPL. 

The Root interpreter, also known as CLING, currently can interpret
C++14 and supports mostly U-nix like operating system like Linux or
MacOSX and Windows support is still experimental.

Among other things, ROOT has the following features: 
 + Run C++ code as scripts
 + Evaluate C++ code interactively
 + Load C libraries such as OpenGL, GNU scientific libraries
 + Load header only libraries such as Boost-Libraries
 + Data analysis tools and statistical libraries
 + Plotting tools 

Possible Use-cases: 
 + Learn C++ faster. 
 + Exploratory design
 + Fast C++ prototyping
 + Explore and play with a wide range of C++ libraries
 + Test new ideas faster.
 + Learn about operating system APIs.

Note: 
 + CLING is the ROOT's C++ interpreter distributed in a standalone way
   without ROOT's additional plotting and statistical libraries.

GIT Repository: 
 + http://github.com/root-project/root.git

ROOT Forum: 
 + https://root-forum.cern.ch/

Download: 
 + https://root.cern.ch/downloading-root - ROOT framework.
 + https://root.cern.ch/downloading-root - CLING - only the C++ interpreter
   without ROOT's GUIs, plotting and statistical libraries. CLING can
   also be embedded on applications.

Demonstration Videos: 

 + [[https://youtu.be/s9PTrWOnDy8?list=PLTG3YvUaExuuISUOLwQDUVdvXgEi1Ez2J&t=503][Intro to ROOT Tutorial Lesson 0 - Getting Started]]
 + [[https://www.youtube.com/watch?v=eoIuqLNvzFs][Cling Interactive OpenGL Demo]]
 + [[https://www.youtube.com/watch?v=Lbi7MLS03Yc][Cling — An Interactive C++ Interpreter]] - by Dmitri Nesteruk.
 + [[https://www.youtube.com/watch?v=PLF5Y5BXD_g][Cling on Ubuntu on Windows]] - by Dmitri Nesteruk.
 + [[https://www.youtube.com/watch?v=1IGTHusaJ18][cling C++ interpreter testdrive]]

Technical Explanations and talks: 

 + Boostcon: [[https://www.youtube.com/watch?v=K2KqEV866Ro][Vassil Vassilev: Interactive, Introspected C++ at CERN - YouTube]]
   + "CERN is the world's biggest particle physics laboratory. It has
     to process about 15 PB/year in order to make such scientific
     breakthroughs. The ROOT Framework's unique abilities enable
     physicists to analyse that data with high efficiency,
     computationally and storage-wise. In the core of ROOT's newest
     version is Cling -- an interactive C++ interpreter, that targets
     support of C++11. Cling replaces a previous C++ interpreter that
     is traditionally the main user interface to ROOT. Cling is built
     on LLVM/Clang compiler infrastructure. The interpreter is not
     only used by ROOT to serialize, deserialize and manipulate the
     C++ OO representation of data, but to help novices learn and
     understand C++ faster." 

 + GoogleTechTalks: [[https://www.youtube.com/watch?v=f9Xfh8pv3Fs][Introducing cling, a C++ Interpreter Based on clang/LLVM - YouTube]]
   + Presented by Axel Naumann, CERN. "At CERN, 50 million lines of
     C++ code are being used by about 10 thousand physicist. Many of
     them are not programming experts. To make writing C++ more
     accessible, ROOT (http://root.cern.ch), one of the core tools at
     CERN, has been using the CINT C++ interpreter for more than 15
     years. CINT also opens up a whole new world of dynamic
     programming: plug-ins, signal/slot, runtime evaluation,
     reflection. In particular, the latter is fundamental to CERN and
     its petabytes of Large Hadron Collider data per year, which are
     created, serialized, and analyzed as C++ objects ..."

** Installation and configuration 
*** Install from source 

Compilation Instructions: 
 + [[https://root.cern.ch/building-root][Building ROOT | ROOT a Data analysis Framework]]

#+BEGIN_SRC shel
  # Clone the repository 
  $ git clone http://github.com/root-project/root.git

  # Create build directory for compiling 
  $ mkdir -p root/build && cd root/build

  # Install program at $HOME/opt/cern-root or ~/opt/cern-root
  $ cmake .. -Dcxx=17 -Dgviz=OFF -Dhdfs=OFF -Dkrb5=OFF -Dladp=OFF -Dmysql=OFF  -Dodbc=OFF \
    -Doracle=OFF -Dpgsql=OFF -Dx11=OFF -Dpython=OFF -Dbounjour=OFF \
    -DCMAKE_INSTALL_PREFIX=$HOME/opt/cern-root

  # Compile with -jN where N is the number of processor cores.
  $ make -j4 && make install

  # Run ROOT REPL:
  $ /home/archbox/opt/cern-root/bin/root.exe 
     ------------------------------------------------------------
    | Welcome to ROOT 6.14/04                http://root.cern.ch |
    |                               (c) 1995-2018, The ROOT Team |
    | Built for linuxx8664gcc                                    |
    | From tags/v6-14-04@v6-14-04, Aug 23 2018, 17:00:44         |
    | Try '.help', '.demo', '.license', '.credits', '.quit'/'.q' |
     ------------------------------------------------------------
#+END_SRC

