Root-cern-repl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-06 Wed 14:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CPP / C++ Review</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="cpp c++ interactive scripting with C++ on CERN's ROOT REPL or CLING."
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="theme/org-nav-theme.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/vnd.microsoft.icon" />
</head>
<body>
<div id="content">
<h1 class="title">CPP / C++ Review</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org472a016">1. C++ CPP CERN - Root Cling Interpreter and tools</a>
<ul>
<li><a href="#orgda9f526">1.1. Overview</a></li>
<li><a href="#org6a1e22f">1.2. Installation and configuration</a>
<ul>
<li><a href="#orgaacbf11">1.2.1. Install from source</a></li>
<li><a href="#org8c168d6">1.2.2. Install from Docker</a></li>
<li><a href="#org6523046">1.2.3. Configuration</a></li>
</ul>
</li>
<li><a href="#orgc475649">1.3. Command Sumamry</a></li>
<li><a href="#org5a3110a">1.4. Playing with Root REPL</a>
<ul>
<li><a href="#org1aec1fe">1.4.1. Start root interpreter</a></li>
<li><a href="#orgd53c877">1.4.2. Run shell command:</a></li>
<li><a href="#orga777e81">1.4.3. Show Math constants</a></li>
<li><a href="#org8dfaf34">1.4.4. Print to stdout</a></li>
<li><a href="#orga8facfa">1.4.5. Paste multiline</a></li>
<li><a href="#orgb7d3509">1.4.6. Playing with STL Vectors</a></li>
<li><a href="#org9f7bad1">1.4.7. Playing with Deque - Double Ended Queue STL Container</a></li>
<li><a href="#orgd0809be">1.4.8. Playing with STL Maps</a></li>
<li><a href="#org924160e">1.4.9. Playing with classes</a></li>
<li><a href="#org2394c6d">1.4.10. Playing with higher order functions and C++11 lambdas</a></li>
<li><a href="#orge06f54d">1.4.11. Playing with STL algorithms</a></li>
<li><a href="#orgd46298a">1.4.12. Show a file</a></li>
<li><a href="#orga8da8c0">1.4.13. Using boost libraries</a></li>
<li><a href="#org7382e2b">1.4.14. Playing with GNU Scientific library shared library</a></li>
<li><a href="#org142ce54">1.4.15. Testing Unix System-Calls and APIs</a></li>
<li><a href="#org02aaced">1.4.16. Run a script with shared library</a></li>
</ul>
</li>
<li><a href="#org3b534ba">1.5. C++ Script Examples</a>
<ul>
<li><a href="#orgf3e0488">1.5.1. Example: Run a Ublas - Boost Library Linear Algebra C++ script</a></li>
<li><a href="#org288d320">1.5.2. Example: GNU Scientific Library C++ Wrapper Script</a></li>
</ul>
</li>
<li><a href="#org4eb2742">1.6. Load Python3 (CPython) C-API in the REPL</a></li>
<li><a href="#orgc0e6548">1.7. Basic Commands</a>
<ul>
<li><a href="#orga2fc573">1.7.1. Show Help</a></li>
</ul>
</li>
<li><a href="#orgf2054d1">1.8. References and Bookmarks</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><a href='index.html'>Index</a></li>
</ul>

<div id="outline-container-org472a016" class="outline-2">
<h2 id="org472a016"><span class="section-number-2">1</span> C++ CPP CERN - Root Cling Interpreter and tools</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgda9f526" class="outline-3">
<h3 id="orgda9f526"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://en.wikipedia.org/wiki/CERN">CERN</a>'s (European Organization for Nuclear Research) <a href="https://en.wikipedia.org/wiki/ROOT">Root Framework</a>
allows one to explore and play with C++ interactively through an
interactive C++ interpreter where the user can type and evaluate
expressions and commands in a similar way to Python's REPL. 
</p>

<p>
The Root interpreter, also known as CLING, currently can interpret
C++14 and supports mostly U-nix like operating system like Linux or
MacOSX and Windows support is still experimental.
</p>

<p>
Among other things, ROOT has the following features: 
</p>
<ul class="org-ul">
<li>Run C++ code as scripts</li>
<li>Evaluate C++ code interactively</li>
<li>Load C libraries such as OpenGL, GNU scientific libraries</li>
<li>Load header only libraries such as Boost-Libraries</li>
<li>Data analysis tools and statistical libraries</li>
<li>Plotting tools</li>
</ul>

<p>
Possible Use-cases: 
</p>
<ul class="org-ul">
<li>Learn C++ faster.</li>
<li>Exploratory design</li>
<li>Fast C++ prototyping</li>
<li>Explore and play with a wide range of C++ libraries</li>
<li>Test new ideas faster.</li>
<li>Learn about operating system APIs.</li>
</ul>

<p>
Note: 
</p>
<ul class="org-ul">
<li>CLING is the ROOT's C++ interpreter distributed in a standalone way
without ROOT's additional plotting and statistical libraries.</li>
</ul>

<p>
GIT Repository: 
</p>
<ul class="org-ul">
<li><a href="http://github.com/root-project/root.git">http://github.com/root-project/root.git</a></li>
</ul>

<p>
ROOT Forum: 
</p>
<ul class="org-ul">
<li><a href="https://root-forum.cern.ch/">https://root-forum.cern.ch/</a></li>
</ul>

<p>
Download: 
</p>
<ul class="org-ul">
<li><a href="https://root.cern.ch/downloading-root">https://root.cern.ch/downloading-root</a> - ROOT framework.</li>
<li><a href="https://root.cern.ch/downloading-root">https://root.cern.ch/downloading-root</a> - CLING - only the C++ interpreter
without ROOT's GUIs, plotting and statistical libraries. CLING can
also be embedded on applications.</li>
</ul>

<p>
Demonstration Videos: 
</p>

<ul class="org-ul">
<li><a href="https://youtu.be/s9PTrWOnDy8?list=PLTG3YvUaExuuISUOLwQDUVdvXgEi1Ez2J&amp;t=503">Intro to ROOT Tutorial Lesson 0 - Getting Started</a></li>
<li><a href="https://www.youtube.com/watch?v=eoIuqLNvzFs">Cling Interactive OpenGL Demo</a></li>
<li><a href="https://www.youtube.com/watch?v=Lbi7MLS03Yc">Cling — An Interactive C++ Interpreter</a> - by Dmitri Nesteruk.</li>
<li><a href="https://www.youtube.com/watch?v=PLF5Y5BXD_g">Cling on Ubuntu on Windows</a> - by Dmitri Nesteruk.</li>
<li><a href="https://www.youtube.com/watch?v=1IGTHusaJ18">cling C++ interpreter testdrive</a></li>
</ul>

<p>
Technical Explanations and talks: 
</p>

<ul class="org-ul">
<li>Boostcon: <a href="https://www.youtube.com/watch?v=K2KqEV866Ro">Vassil Vassilev: Interactive, Introspected C++ at CERN - YouTube</a>
<ul class="org-ul">
<li>"CERN is the world's biggest particle physics laboratory. It has
to process about 15 PB/year in order to make such scientific
breakthroughs. The ROOT Framework's unique abilities enable
physicists to analyse that data with high efficiency,
computationally and storage-wise. In the core of ROOT's newest
version is Cling &#x2013; an interactive C++ interpreter, that targets
support of C++11. Cling replaces a previous C++ interpreter that
is traditionally the main user interface to ROOT. Cling is built
on LLVM/Clang compiler infrastructure. The interpreter is not
only used by ROOT to serialize, deserialize and manipulate the
C++ OO representation of data, but to help novices learn and
understand C++ faster."</li>
</ul></li>

<li>GoogleTechTalks: <a href="https://www.youtube.com/watch?v=f9Xfh8pv3Fs">Introducing cling, a C++ Interpreter Based on clang/LLVM - YouTube</a>
<ul class="org-ul">
<li>Presented by Axel Naumann, CERN. "At CERN, 50 million lines of
C++ code are being used by about 10 thousand physicist. Many of
them are not programming experts. To make writing C++ more
accessible, ROOT (<a href="http://root.cern.ch">http://root.cern.ch</a>), one of the core tools at
CERN, has been using the CINT C++ interpreter for more than 15
years. CINT also opens up a whole new world of dynamic
programming: plug-ins, signal/slot, runtime evaluation,
reflection. In particular, the latter is fundamental to CERN and
its petabytes of Large Hadron Collider data per year, which are
created, serialized, and analyzed as C++ objects &#x2026;"</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6a1e22f" class="outline-3">
<h3 id="org6a1e22f"><span class="section-number-3">1.2</span> Installation and configuration</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgaacbf11" class="outline-4">
<h4 id="orgaacbf11"><span class="section-number-4">1.2.1</span> Install from source</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Compilation Instructions: 
</p>
<ul class="org-ul">
<li><a href="https://root.cern.ch/building-root">Building ROOT | ROOT a Data analysis Framework</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-shel"># Clone the repository 
$ git clone http://github.com/root-project/root.git

# Create build directory for compiling 
$ mkdir -p root/build &amp;&amp; cd root/build

# Install program at $HOME/opt/cern-root or ~/opt/cern-root
$ cmake .. -Dcxx=17 -Dgviz=OFF -Dhdfs=OFF -Dkrb5=OFF -Dladp=OFF -Dmysql=OFF  -Dodbc=OFF \
  -Doracle=OFF -Dpgsql=OFF -Dx11=OFF -Dpython=OFF -Dbounjour=OFF \
  -DCMAKE_INSTALL_PREFIX=$HOME/opt/cern-root

# Compile with -jN where N is the number of processor cores.
$ make -j4 &amp;&amp; make install
