Root-cern-repl.org
*** Install from Docker 

Docker Image: 
 + DockerFile: https://github.com/mazurov/cern-root
 + DockerHub:  https://hub.docker.com/r/mazurov/cern-root

 *Pull docker Image:*

#+BEGIN_SRC sh 
  $ docker pull mazurov/cern-root
#+END_SRC

 *Run Shell:*

#+BEGIN_SRC sh 
  $ docker run -t -i -a stdout -a stdin mazurov/cern-root

  [root@4b6810a8ca0b /]# ls /opt/root/bin/    
  genreflex           rmkdepend     rooteventselector  setenvwrap.csh
  hadd                root          rootls             setxrd.csh
  hist2workspace      root-config   rootmkdir          setxrd.sh
  memprobe            root.exe      rootmv             ssh2rpd
  pq2                 rootbrowse    rootn.exe          thisroot.csh
  prepareHistFactory  rootcint      rootnb.exe         thisroot.sh
  proofd              rootcling     rootprint          xpdtest
  proofexecv          rootcp        rootrm
  proofserv           rootd         roots
  proofserv.exe       rootdrawtree  roots.exe
  [root@4b6810a8ca0b /]# 
  [root@4b6810a8ca0b /]# 

#+END_SRC


 *Run ROOT REPL:*

#+BEGIN_SRC sh 
  $ docker run -t -i -a stdout -a stdin --entrypoint "root.exe" mazurov/cern-root 
#+END_SRC

Session:

#+BEGIN_SRC sh 
    ------------------------------------------------------------
    | Welcome to ROOT 6.09/02                http://root.cern.ch |
    |                               (c) 1995-2016, The ROOT Team |
    | Built for linuxx8664gcc                                    |
    | From tag v6-09-02, 8 March 2017                            |
    | Try '.help', '.demo', '.license', '.credits', '.quit'/'.q' |
     ------------------------------------------------------------

  root [0] 
  root [0] .q
  (base) 

  root [0] std::cout << "Hello world C++11" << "\n";
  Hello world C++11
  root [1] 
#+END_SRC

 *Mount disk directory on docker image*

#+BEGIN_SRC sh 
  $ docker run -it --rm -w /user -v $(pwd):/user --entrypoint="root.exe" mazurov/cern-root
#+END_SRC

Commands:
 + -w /user
   * Set Docker current directory to user
 + -v $(pwd):/user
   * Mount current disk directory into the directory /user in the Docker image.
 + --entrypoint="/opt/root/bin/root.exe"
   * Set entry point to ROOT REPL.

Session Example: 

#+BEGIN_SRC sh 
  $ docker run -it --rm -w /user -v $(pwd):/user --entrypoint="root.exe" mazurov/cern-root

   root [5] .! ls
   arraysFun.cpp			    object-lifecycle.cpp
   assert.cpp			    operator-overload1.bin
   basic-io.cpp			    operator-overload1.cpp
   boost				    operator-overload2.bin
   cpp-functor.cpp			    operator-overload2.cpp
   ... ...    ... ...    ... ...    ... ...    ... ...    ... ... 

   # Load File and run function main()
   root [6] .L numeric-limits.cpp 
   root [7] 
   root [7] main()
   Numeric limits for type: bool
   ------------------------------------------------------------
                            Type:                     bool
                      Is integer:                     true
                       Is signed:                    false
             Number of digits 10:                        0
         Max Number of digits 10:                        0
                         Min Abs:                        0
                             Min:                        0
                             Max:                        1
                   Size in bytes:                        1
                    Size in bits:                        8
   ...    ...    ...    ...    ...    ...    ...    ... 
#+END_SRC

Bash Function for usage simplification: 

#+BEGIN_SRC sh 
  function docker-run(){
     DIMAGE="$1"
     if [ -n "$2" ] ; then 
        ENTRYPOINT="$2"
     else 
        ENTRYPOINT="/bin/sh"
     fi 
     docker run -it --rm -w /user -v $(pwd):/user --entrypoint $ENTRYPOINT $DIMAGE 
  }
 
  # Run shell (default entry-point)
  $ docker-run mazurov/cern-root

  # Run root.exe entry-point of Docker image (mazurov/cern-root)
  $ docker-run mazurov/cern-root root.exe
#+END_SRC


