Root-cern-repl.html

# Run ROOT REPL:
$ /home/archbox/opt/cern-root/bin/root.exe 
   ------------------------------------------------------------
  | Welcome to ROOT 6.14/04                http://root.cern.ch |
  |                               (c) 1995-2018, The ROOT Team |
  | Built for linuxx8664gcc                                    |
  | From tags/v6-14-04@v6-14-04, Aug 23 2018, 17:00:44         |
  | Try '.help', '.demo', '.license', '.credits', '.quit'/'.q' |
   ------------------------------------------------------------
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c168d6" class="outline-4">
<h4 id="org8c168d6"><span class="section-number-4">1.2.2</span> Install from Docker</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Docker Image: 
</p>
<ul class="org-ul">
<li>DockerFile: <a href="https://github.com/mazurov/cern-root">https://github.com/mazurov/cern-root</a></li>
<li>DockerHub:  <a href="https://hub.docker.com/r/mazurov/cern-root">https://hub.docker.com/r/mazurov/cern-root</a></li>
</ul>

<p>
<b>Pull docker Image:</b>
</p>

<div class="org-src-container">
<pre class="src src-sh">$ docker pull mazurov/cern-root
</pre>
</div>

<p>
<b>Run Shell:</b>
</p>

<div class="org-src-container">
<pre class="src src-sh">$ docker run -t -i -a stdout -a stdin mazurov/cern-root

[root@4b6810a8ca0b /]# ls /opt/root/bin/    
genreflex           rmkdepend     rooteventselector  setenvwrap.csh
hadd                root          rootls             setxrd.csh
hist2workspace      root-config   rootmkdir          setxrd.sh
memprobe            root.exe      rootmv             ssh2rpd
pq2                 rootbrowse    rootn.exe          thisroot.csh
prepareHistFactory  rootcint      rootnb.exe         thisroot.sh
proofd              rootcling     rootprint          xpdtest
proofexecv          rootcp        rootrm
proofserv           rootd         roots
proofserv.exe       rootdrawtree  roots.exe
[root@4b6810a8ca0b /]# 
[root@4b6810a8ca0b /]# 

</pre>
</div>


<p>
<b>Run ROOT REPL:</b>
</p>

<div class="org-src-container">
<pre class="src src-sh">$ docker run -t -i -a stdout -a stdin --entrypoint <span class="org-string">"root.exe"</span> mazurov/cern-root 
</pre>
</div>

<p>
Session:
</p>

<div class="org-src-container">
<pre class="src src-sh">  ------------------------------------------------------------
  | Welcome to ROOT 6.09/02                http://root.cern.ch |
  |                               (c) 1995-2016, The ROOT Team |
  | Built for linuxx8664gcc                                    |
  | From tag v6-09-02, 8 March 2017                            |
  | Try <span class="org-string">'.help'</span>, <span class="org-string">'.demo'</span>, <span class="org-string">'.license'</span>, <span class="org-string">'.credits'</span>, <span class="org-string">'.quit'</span>/<span class="org-string">'.q'</span> |
   ------------------------------------------------------------

root [0] 
root [0] .q
(base) 

root [0] std::cout &lt;&lt; <span class="org-string">"Hello world C++11"</span> &lt;&lt; <span class="org-string">"\n"</span>;
<span class="org-sh-heredoc">Hello world C++11</span>
<span class="org-sh-heredoc">root [1] </span>
</pre>
</div>

<p>
<b>Mount disk directory on docker image</b>
</p>

<div class="org-src-container">
<pre class="src src-sh">$ docker run -it --rm -w /user -v $(<span class="org-sh-quoted-exec">pwd</span>):/user --entrypoint=<span class="org-string">"root.exe"</span> mazurov/cern-root
</pre>
</div>

<p>
Commands:
</p>
<ul class="org-ul">
<li>-w /user
<ul class="org-ul">
<li>Set Docker current directory to user</li>
</ul></li>
<li>-v $(pwd):/user
<ul class="org-ul">
<li>Mount current disk directory into the directory /user in the Docker image.</li>
</ul></li>
<li>&#x2013;entrypoint="/opt/root/bin/root.exe"
<ul class="org-ul">
<li>Set entry point to ROOT REPL.</li>
</ul></li>
</ul>

<p>
Session Example: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ docker run -it --rm -w /user -v $(<span class="org-sh-quoted-exec">pwd</span>):/user --entrypoint=<span class="org-string">"root.exe"</span> mazurov/cern-root

 root [5] .! ls
 arraysFun.cpp                      object-lifecycle.cpp
 assert.cpp                         operator-overload1.bin
 basic-io.cpp                       operator-overload1.cpp
 boost                              operator-overload2.bin
 cpp-functor.cpp                            operator-overload2.cpp
 ... ...    ... ...    ... ...    ... ...    ... ...    ... ... 

 <span class="org-comment-delimiter"># </span><span class="org-comment">Load File and run function main()</span>
 root [6] .L numeric-limits.cpp 
 root [7] 
 root [7] main()
 Numeric limits for type: bool
 ------------------------------------------------------------
                          Type:                     bool
                    Is integer:                     true
                     Is signed:                    false
           Number of digits 10:                        0
       Max Number of digits 10:                        0
                       Min Abs:                        0
                           Min:                        0
                           Max:                        1
                 Size<span class="org-keyword"> in</span> bytes:                        1
                  Size<span class="org-keyword"> in</span> bits:                        8
 ...    ...    ...    ...    ...    ...    ...    ... 
</pre>
</div>

<p>
Bash Function for usage simplification: 
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">docker-run</span>(){
   <span class="org-variable-name">DIMAGE</span>=<span class="org-string">"$1"</span>
   <span class="org-keyword">if</span> [ -n <span class="org-string">"$2"</span> ] ; <span class="org-keyword">then</span> 
      <span class="org-variable-name">ENTRYPOINT</span>=<span class="org-string">"$2"</span>
   <span class="org-keyword">else</span> 
      <span class="org-variable-name">ENTRYPOINT</span>=<span class="org-string">"/bin/sh"</span>
   <span class="org-keyword">fi</span> 
   docker run -it --rm -w /user -v $(<span class="org-sh-quoted-exec">pwd</span>):/user --entrypoint $<span class="org-variable-name">ENTRYPOINT</span> $<span class="org-variable-name">DIMAGE</span> 
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Run shell (default entry-point)</span>
$ docker-run mazurov/cern-root

<span class="org-comment-delimiter"># </span><span class="org-comment">Run root.exe entry-point of Docker image (mazurov/cern-root)</span>
$ docker-run mazurov/cern-root root.exe
</pre>
</div>
</div>
</div>
