Root-cern-repl.org
*** Configuration 

Set environment variables: 

 - Add this piece of code to any of those configuration files:
   ~/.profile, =~/.bash_profile= or ~/.bashrc. 

#+BEGIN_SRC sh 
  # Set root directory (ROOTSYS) to the path where it was installed 
  export ROOTSYS=$HOME/opt/root 
  # DO NOT change those variables below 
  export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$ROOTSYS/lib 
  export PATH=$PATH:$ROOTSYS/bin
  alias cern-root="$ROOTSYS/bin/root -l"
#+END_SRC

Questions about configuration files: 

 + [[http://insectnation.org/articles/basic-root.html][Basic ROOT start-up guide | Insectnation]]
 + [[https://root.cern.ch/root/roottalk/roottalk00/3018.html][RootTalk: Re: ROOT .rootrc, etc.]]
 + [[https://root-forum.cern.ch/t/setting-include-path-in-rootrc-file/6245][Setting .include path in .rootrc file? - ROOT - ROOT Forum]]
 + 

Current install: 

#+BEGIN_SRC sh 
  $ which root
  /home/archbox/opt/root/bin/root

  $ pwd
  /home/archbox/opt/root

  archbox@localhost 16:10 ~/opt/root
  $ tree -L 1 .
  .
  ├── aclocal
  ├── bin
  ├── cmake
  ├── config
  ├── emacs
  ├── etc
  ├── fonts
  ├── geom
  ├── icons
  ├── include
  ├── lib
  ├── LICENSE
  ├── macros
  ├── man
  ├── README
  ├── test
  ├── tmva
  └── tutorials

  17 directories, 1 file

#+END_SRC

Show tools available: 

#+BEGIN_SRC sh
  $ tree -L 1 bin/
  bin/
  ├── g2root
  ├── genreflex
  ├── h2root
  ├── hadd
  ├── hist2workspace
  ├── memprobe
  ├── pq2
  ├── prepareHistFactory
  ├── proofd
  ├── proofexecv
  ├── proofserv
  ├── proofserv.exe
  ├── rmkdepend
  ├── root
  ├── rootbrowse
  ├── rootcint
  ├── rootcling
  ├── root-config
  ├── rootcp
  ├── rootd
  ├── rootdrawtree
  ├── rooteventselector
  ├── root.exe
  ├── rootls
  ├── rootmkdir
  ├── rootmv
  ├── rootnb.exe
  ├── rootn.exe
  ├── rootprint
  ├── rootrm
  ├── roots
  ├── roots.exe
  ├── rootslimtree
  ├── setenvwrap.csh
  ├── setxrd.csh
  ├── setxrd.sh
  ├── ssh2rpd
  ├── thisroot.csh
  ├── thisroot.sh
  ├── xpdtest
  └── xproofd

  0 directories, 41 files

#+END_SRC

