Root-cern-repl.html


<div id="outline-container-org6523046" class="outline-4">
<h4 id="org6523046"><span class="section-number-4">1.2.3</span> Configuration</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Set environment variables: 
</p>

<ul class="org-ul">
<li>Add this piece of code to any of those configuration files:
~/.profile, <code>~/.bash_profile</code> or ~/.bashrc.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Set root directory (ROOTSYS) to the path where it was installed </span>
<span class="org-builtin">export</span> <span class="org-variable-name">ROOTSYS</span>=$<span class="org-variable-name">HOME</span>/opt/root 
<span class="org-comment-delimiter"># </span><span class="org-comment">DO NOT change those variables below </span>
<span class="org-builtin">export</span> <span class="org-variable-name">LD_LIBRARY_PATH</span>=$<span class="org-variable-name">LD_LIBRARY_PATH</span>:$<span class="org-variable-name">ROOTSYS</span>/lib 
<span class="org-builtin">export</span> <span class="org-variable-name">PATH</span>=$<span class="org-variable-name">PATH</span>:$<span class="org-variable-name">ROOTSYS</span>/bin
<span class="org-builtin">alias</span> cern-root=<span class="org-string">"$ROOTSYS/bin/root -l"</span>
</pre>
</div>

<p>
Questions about configuration files: 
</p>

<ul class="org-ul">
<li><a href="http://insectnation.org/articles/basic-root.html">Basic ROOT start-up guide | Insectnation</a></li>
<li><a href="https://root.cern.ch/root/roottalk/roottalk00/3018.html">RootTalk: Re: ROOT .rootrc, etc.</a></li>
<li><a href="https://root-forum.cern.ch/t/setting-include-path-in-rootrc-file/6245">Setting .include path in .rootrc file? - ROOT - ROOT Forum</a></li>
<li></li>
</ul>

<p>
Current install: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ which root
/home/archbox/opt/root/bin/root

$ pwd
/home/archbox/opt/root

archbox@localhost 16:10 ~/opt/root
$ tree -L 1 .
<span class="org-builtin">.</span>
&#9500;&#9472;&#9472; aclocal
&#9500;&#9472;&#9472; bin
&#9500;&#9472;&#9472; cmake
&#9500;&#9472;&#9472; config
&#9500;&#9472;&#9472; emacs
&#9500;&#9472;&#9472; etc
&#9500;&#9472;&#9472; fonts
&#9500;&#9472;&#9472; geom
&#9500;&#9472;&#9472; icons
&#9500;&#9472;&#9472; include
&#9500;&#9472;&#9472; lib
&#9500;&#9472;&#9472; LICENSE
&#9500;&#9472;&#9472; macros
&#9500;&#9472;&#9472; man
&#9500;&#9472;&#9472; README
&#9500;&#9472;&#9472; test
&#9500;&#9472;&#9472; tmva
&#9492;&#9472;&#9472; tutorials

17 directories, 1 file

</pre>
</div>

<p>
Show tools available: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ tree -L 1 bin/
bin/
&#9500;&#9472;&#9472; g2root
&#9500;&#9472;&#9472; genreflex
&#9500;&#9472;&#9472; h2root
&#9500;&#9472;&#9472; hadd
&#9500;&#9472;&#9472; hist2workspace
&#9500;&#9472;&#9472; memprobe
&#9500;&#9472;&#9472; pq2
&#9500;&#9472;&#9472; prepareHistFactory
&#9500;&#9472;&#9472; proofd
&#9500;&#9472;&#9472; proofexecv
&#9500;&#9472;&#9472; proofserv
&#9500;&#9472;&#9472; proofserv.exe
&#9500;&#9472;&#9472; rmkdepend
&#9500;&#9472;&#9472; root
&#9500;&#9472;&#9472; rootbrowse
&#9500;&#9472;&#9472; rootcint
&#9500;&#9472;&#9472; rootcling
&#9500;&#9472;&#9472; root-config
&#9500;&#9472;&#9472; rootcp
&#9500;&#9472;&#9472; rootd
&#9500;&#9472;&#9472; rootdrawtree
&#9500;&#9472;&#9472; rooteventselector
&#9500;&#9472;&#9472; root.exe
&#9500;&#9472;&#9472; rootls
&#9500;&#9472;&#9472; rootmkdir
&#9500;&#9472;&#9472; rootmv
&#9500;&#9472;&#9472; rootnb.exe
&#9500;&#9472;&#9472; rootn.exe
&#9500;&#9472;&#9472; rootprint
&#9500;&#9472;&#9472; rootrm
&#9500;&#9472;&#9472; roots
&#9500;&#9472;&#9472; roots.exe
&#9500;&#9472;&#9472; rootslimtree
&#9500;&#9472;&#9472; setenvwrap.csh
&#9500;&#9472;&#9472; setxrd.csh
&#9500;&#9472;&#9472; setxrd.sh
&#9500;&#9472;&#9472; ssh2rpd
&#9500;&#9472;&#9472; thisroot.csh
&#9500;&#9472;&#9472; thisroot.sh
&#9500;&#9472;&#9472; xpdtest
&#9492;&#9472;&#9472; xproofd

0 directories, 41 files

</pre>
</div>
</div>
</div>
</div>
