Root-cern-repl.org
** Command Sumamry 


| REPL Command       | Description                                                                                |
|--------------------+--------------------------------------------------------------------------------------------|
| .?                 | Show help                                                                                  |
| .q                 | Exit ROOT shell                                                                            |
| .L file.cpp        | Load file.cpp, so it loads all the file's classes and functions                            |
| .x script.cxx      | Load and execute ROOT script or C++ ordinary source code. The entry point is void script() |
| .include           | Show include path                                                                          |
| .I <include path>  | Add include path to search for header files (*.h), for instance .I /usr/include/qt5/       |
| .! <shell command> | Run shell command such as ls on Unix.                                                      |
| .class TFile       | Show all methods and fields of the class TFile                                             |
|                    |                                                                                            |
|                    |                                                                                            |

Documentation: 
 + Source Code Documentation: https://root.cern/doc/v612/files.html
 + 

GSystem object: 

#+BEGIN_SRC cpp 
 gSystem->AddLinkedLibs (...) 
 gSystem->AddIncludePath(...)

 gROOT->GetListOfClasses()
 gROOT->GetListOfColors()
 gROOT->GetListOfTypes()
 gROOT->GetListOfGlobals()
 gROOT->GetListOfGlobalFunctions()
 gROOT->GetListOfFiles()
 gROOT->GetListOfMappedFiles()
 gROOT->GetListOfSockets()
 gROOT->GetListOfCanvases()
 gROOT->GetListOfStyles()
 gROOT->GetListOfFunctions()
 gROOT->GetListOfSpecials()
 gROOT->GetListOfGeometries()
 gROOT->GetListOfBrowsers()
 gROOT->GetListOfMessageHandlers()
#+END_SRC

Get Version: 

#+BEGIN_SRC cpp 
  root [20] gROOT->GetVersion()
  (const char *) "6.14/04"
  root [21]
#+END_SRC

Get and Set Prompt: 

#+BEGIN_SRC cpp 
  root [0] static_cast<TRint*>(gROOT->GetApplication())->GetPrompt()
  (char *) "root [1] "
  root [1]

  root [1] static_cast<TRint*>(gROOT->GetApplication())->SetPrompt(">> ")
  (const char *) "root [%d] "
  >>
  >>
#+END_SRC

Change and check current working directory.

#+BEGIN_SRC cpp 
  root [30] gSystem->cd("/home/archbox")
  (bool) true

  root [31] gSystem->pwd()
  (const char *) "/home/archbox"
  root [32] 
  root [32] 
#+END_SRC

Get environment variables: 

#+BEGIN_SRC cpp 
  root [32] gSystem->Getenv("HOME")
  (const char *) "/home/archbox"

  root [33] gSystem->Getenv("PATH")
  (const char *) "/usr/lib64/qt-3.3/bin:/usr/local/bin:/usr/bin:/bin:..."
#+END_SRC

Add Include Path: 

 -- Ref: [[https://root-forum.cern.ch/t/setting-include-path-in-rootrc-file/6245][Setting .include path in .rootrc file? - ROOT - ROOT Forum]]

#+BEGIN_SRC cpp 
  gSystem->SetIncludePath(" -Imyincludepath1 ");
  gSystem->SetIncludePath(" -Imyincludepath2 ");
  ...
#+END_SRC

Eval String: 

#+BEGIN_SRC cpp 
  root [0] gROOT->ProcessLine("std::cout << \"Hello world\" << std::endl;");
  Hello world
  root [1] 

  root [2] gROOT->ProcessLine("cos(M_PI)");
  (double) -1.0000000

  root [3] gROOT->ProcessLine("cos(2 * M_PI)");
  (double) 1.0000000
  root [4] 
#+END_SRC

Print configuration: 
 
 + Command: gEnv->Print()

#+BEGIN_SRC cpp 
  Root [5] gEnv->Print()
  Unix.*.Root.UseTTFonts:   true                           [Global]
  WinNT.UseNetAPI:          true                           [Global]
  Unix.*.Root.UseThreads:   false                          [Global]
  Root.CompressionAlgorithm: 0                              [Global]
  Root.ShowPath:            false                          [Global]
  Root.TMemStat:            0                              [Global]
  Root.TMemStat.buffersize: 100000                         [Global]
  Root.TMemStat.maxcalls:   5000000                        [Global]
  Root.TMemStat.system:                                    [Global]
  Root.MemStat:             0                              [Global]
  Root.MemStat.size:        -1                             [Global]
  Root.MemStat.cnt:         -1                             [Global]
  Root.ObjectStat:          0                              [Global]
  Root.MemCheck:            0                              [Global]

#+END_SRC

