Root-cern-repl.html

<div id="outline-container-orgc475649" class="outline-3">
<h3 id="orgc475649"><span class="section-number-3">1.3</span> Command Sumamry</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">REPL Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">.?</td>
<td class="org-left">Show help</td>
</tr>

<tr>
<td class="org-left">.q</td>
<td class="org-left">Exit ROOT shell</td>
</tr>

<tr>
<td class="org-left">.L file.cpp</td>
<td class="org-left">Load file.cpp, so it loads all the file's classes and functions</td>
</tr>

<tr>
<td class="org-left">.x script.cxx</td>
<td class="org-left">Load and execute ROOT script or C++ ordinary source code. The entry point is void script()</td>
</tr>

<tr>
<td class="org-left">.include</td>
<td class="org-left">Show include path</td>
</tr>

<tr>
<td class="org-left">.I &lt;include path&gt;</td>
<td class="org-left">Add include path to search for header files (*.h), for instance .I <i>usr/include/qt5</i></td>
</tr>

<tr>
<td class="org-left">.! &lt;shell command&gt;</td>
<td class="org-left">Run shell command such as ls on Unix.</td>
</tr>

<tr>
<td class="org-left">.class TFile</td>
<td class="org-left">Show all methods and fields of the class TFile</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Documentation: 
</p>
<ul class="org-ul">
<li>Source Code Documentation: <a href="https://root.cern/doc/v612/files.html">https://root.cern/doc/v612/files.html</a></li>
<li></li>
</ul>

<p>
GSystem object: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">gSystem-&gt;AddLinkedLibs <span class="org-rainbow-delimiters-depth-1">(</span>...<span class="org-rainbow-delimiters-depth-1">)</span> 
gSystem-&gt;AddIncludePath<span class="org-rainbow-delimiters-depth-1">(</span>...<span class="org-rainbow-delimiters-depth-1">)</span>

gROOT-&gt;GetListOfClasses<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfColors<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfTypes<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfGlobals<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfGlobalFunctions<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfFiles<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfMappedFiles<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfSockets<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfCanvases<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfStyles<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfFunctions<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfSpecials<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfGeometries<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfBrowsers<span class="org-rainbow-delimiters-depth-1">()</span>
gROOT-&gt;GetListOfMessageHandlers<span class="org-rainbow-delimiters-depth-1">()</span>
</pre>
</div>

<p>
Get Version: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>20<span class="org-rainbow-delimiters-depth-1">]</span> gROOT-&gt;GetVersion<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"6.14/04"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>21<span class="org-rainbow-delimiters-depth-1">]</span>
</pre>
</div>

<p>
Get and Set Prompt: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">TRint</span>*<span class="org-rainbow-delimiters-depth-1">&gt;(</span>gROOT-&gt;GetApplication<span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rainbow-delimiters-depth-1">)</span>-&gt;GetPrompt<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"root [1] "</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">TRint</span>*<span class="org-rainbow-delimiters-depth-1">&gt;(</span>gROOT-&gt;GetApplication<span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rainbow-delimiters-depth-1">)</span>-&gt;SetPrompt<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"&gt;&gt; "</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"root [%d] "</span>
&gt;&gt;
&gt;&gt;
</pre>
</div>

<p>
Change and check current working directory.
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>30<span class="org-rainbow-delimiters-depth-1">]</span> gSystem-&gt;cd<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/home/archbox"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">bool</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-constant">true</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>31<span class="org-rainbow-delimiters-depth-1">]</span> gSystem-&gt;pwd<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/home/archbox"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>32<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>32<span class="org-rainbow-delimiters-depth-1">]</span> 
</pre>
</div>

<p>
Get environment variables: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>32<span class="org-rainbow-delimiters-depth-1">]</span> gSystem-&gt;Getenv<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"HOME"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/home/archbox"</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>33<span class="org-rainbow-delimiters-depth-1">]</span> gSystem-&gt;Getenv<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"PATH"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/usr/lib64/qt-3.3/bin:/usr/local/bin:/usr/bin:/bin:..."</span>
</pre>
</div>

<p>
Add Include Path: 
</p>

<p>
&#x2013; Ref: <a href="https://root-forum.cern.ch/t/setting-include-path-in-rootrc-file/6245">Setting .include path in .rootrc file? - ROOT - ROOT Forum</a>
</p>

<div class="org-src-container">
<pre class="src src-cpp">gSystem-&gt;SetIncludePath<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">" -Imyincludepath1 "</span><span class="org-rainbow-delimiters-depth-1">)</span>;
gSystem-&gt;SetIncludePath<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">" -Imyincludepath2 "</span><span class="org-rainbow-delimiters-depth-1">)</span>;
...
</pre>
</div>

<p>
Eval String: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> gROOT-&gt;ProcessLine<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"std::cout &lt;&lt; \"Hello world\" &lt;&lt; std::endl;"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
Hello <span class="org-type">world</span>
<span class="org-variable-name">root</span> <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> gROOT-&gt;ProcessLine<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"cos(M_PI)"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> -1.0000000

root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> gROOT-&gt;ProcessLine<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"cos(2 * M_PI)"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 1.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> 
</pre>
</div>

<p>
Print configuration: 
</p>

<ul class="org-ul">
<li>Command: gEnv-&gt;Print()</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">Root <span class="org-rainbow-delimiters-depth-1">[</span>5<span class="org-rainbow-delimiters-depth-1">]</span> gEnv-&gt;Print<span class="org-rainbow-delimiters-depth-1">()</span>
Unix.*.Root.UseTTFonts:   <span class="org-constant">true</span>                           <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">WinNT.UseNetAPI</span>:          <span class="org-constant">true</span>                           <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
Unix.*.Root.UseThreads:   <span class="org-constant">false</span>                          <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.CompressionAlgorithm</span>: 0                              <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.ShowPath</span>:            <span class="org-constant">false</span>                          <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.TMemStat</span>:            0                              <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.TMemStat.buffersize</span>: 100000                         <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.TMemStat.maxcalls</span>:   5000000                        <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.TMemStat.system</span>:                                    <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">Global</span><span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.MemStat</span>:             0                              <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.MemStat.size</span>:        -1                             <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.MemStat.cnt</span>:         -1                             <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.ObjectStat</span>:          0                              <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-function-name">Root.MemCheck</span>:            0                              <span class="org-rainbow-delimiters-depth-1">[</span>Global<span class="org-rainbow-delimiters-depth-1">]</span>

</pre>
</div>
</div>
</div>
