Root-cern-repl.org
** Playing with Root REPL 
*** Start root interpreter 
#+BEGIN_SRC sh 
  $ $HOME/opt/root/bin/root 
  ERROR in cling::CIFactory::createCI(): cannot extract standard library include paths!
  Invoking:
    LC_ALL=C ccache  -O3 -DNDEBUG -xc++ -E -v /dev/null 2>&1 >/dev/null | awk '/^#include </,/^End of search/{if (!/^#include </ && !/^End of search/){ print }}' | GREP_OPTIONS= grep -E "(c|g)\+\+"
  Results was:
  With exit code 256
     ------------------------------------------------------------
    | Welcome to ROOT 6.14/04                http://root.cern.ch |
    |                               (c) 1995-2018, The ROOT Team |
    | Built for linuxx8664gcc                                    |
    | From tags/v6-14-04@v6-14-04, Aug 23 2018, 17:00:44         |
    | Try '.help', '.demo', '.license', '.credits', '.quit'/'.q' |
     ------------------------------------------------------------

  root [0] 
#+END_SRC
*** Run shell command: 

#+BEGIN_SRC sh 
  root [66] .! ls
  a.out		 clang1.cpp	clang-start.bin   myclass.cpp	    testclang.bin
  cashFlowApp.cpp  clangcpp1.bin	clang-start.cpp   myclass.hpp	    testclang.cpp
  cashflow.cpp	 clangcpp1.cpp	diagnostics.bin   numLimits.cpp     testcl.bin
  cashflow.h	 clanger.bin	diagnostics.cpp   printHeaders.cpp  testcl.cpp
  cashflow.so	 clanger.c	dump-classes.cpp  source-info.bin
  clang1.bin	 clanger.cpp	libcashflow.cpp   source-info.cpp
  root [67]

  root [67] .! pwd
  /home/archbox/shared/reflection-root
  root [68] 
#+END_SRC
*** Show Math constants 

#+BEGIN_SRC cpp 
  root [5] M_PI
  (double) 3.1415927
  root [6] M_E
  (double) 2.7182818
  root [7] 
  root [7] // Predefined math constants in the header cmath
  root [8] M_E
  (double) 2.7182818
  root [9] M_PI
  (double) 3.1415927
  root [10] M_LOG10E // Logarithm to base 2 of E
  (double) 0.43429448
  root [11] M_LN10 // Natural log of 10
  (double) 2.3025851
  root [12] M_PI_4 // PI divided by 4 or PI/4
  (double) 0.78539816
  root [13] M_2_PI // 2 * PI or 360 deg
  (double) 0.63661977
  root [14] M_SQRT2 // Square root of 2
  (double) 1.4142136
  root [15] M_SQRT1_2
  (double) 0.70710678
  root [16] 
#+END_SRC
*** Print to stdout

#+BEGIN_SRC cpp 
  root [20] std::cout << "Hello world" << std::endl;
  Hello world
  root [21] 

  root [21] for(int i = 0 ; i < 10; i++){ std::cout << "i = " << i << std::endl; }
  i = 0
  i = 1
  i = 2
  i = 3
  i = 4
  i = 5
  i = 6
  i = 7
  i = 8
  i = 9

#+END_SRC
*** Paste multiline

#+BEGIN_SRC cpp 
  // To paste a multi line code, paste the code between brackets
    // To paste a multi line code, paste the code between brackets
    {
    auto func = [](double x){
        return x * x - 4 * x + 10;
    };
    }

    root [38] func(4.0)
    (double) 10.000000
    root [39] 
    root [39] func(0)
    (double) 10.000000
    root [40] func(3)
    (double) 7.0000000
    root [41] func(5)
    (double) 15.000000
    root [42] func(10)
    (double) 70.000000
    root [43] 

#+END_SRC
