Root-cern-repl.html

<div id="outline-container-org5a3110a" class="outline-3">
<h3 id="org5a3110a"><span class="section-number-3">1.4</span> Playing with Root REPL</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org1aec1fe" class="outline-4">
<h4 id="org1aec1fe"><span class="section-number-4">1.4.1</span> Start root interpreter</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-sh">$ $<span class="org-variable-name">HOME</span>/opt/root/bin/root 
ERROR<span class="org-keyword"> in</span> cling::CIFactory::createCI(): cannot extract standard library include paths!
<span class="org-function-name">Invoking</span>:
  <span class="org-variable-name">LC_ALL</span>=C ccache  -O3 -DNDEBUG -xc++ -E -v /dev/null 2&gt;&amp;1 &gt;/dev/null | awk <span class="org-string">'/^#include &lt;/,/^End of search/{if (!/^#include &lt;/ &amp;&amp; !/^End of search/){ print }}'</span> | <span class="org-variable-name">GREP_OPTIONS</span>= grep -E <span class="org-string">"(c|g)\+\+"</span>
Results was:
With exit code 256
   ------------------------------------------------------------
  | Welcome to ROOT 6.14/04                http://root.cern.ch |
  |                               (c) 1995-2018, The ROOT Team |
  | Built for linuxx8664gcc                                    |
  | From tags/v6-14-04@v6-14-04, Aug 23 2018, 17:00:44         |
  | Try <span class="org-string">'.help'</span>, <span class="org-string">'.demo'</span>, <span class="org-string">'.license'</span>, <span class="org-string">'.credits'</span>, <span class="org-string">'.quit'</span>/<span class="org-string">'.q'</span> |
   ------------------------------------------------------------

root [0] 
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd53c877" class="outline-4">
<h4 id="orgd53c877"><span class="section-number-4">1.4.2</span> Run shell command:</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-sh">root [66] .! ls
a.out            clang1.cpp     clang-start.bin   myclass.cpp       testclang.bin
cashFlowApp.cpp  clangcpp1.bin  clang-start.cpp   myclass.hpp       testclang.cpp
cashflow.cpp     clangcpp1.cpp  diagnostics.bin   numLimits.cpp     testcl.bin
cashflow.h       clanger.bin    diagnostics.cpp   printHeaders.cpp  testcl.cpp
cashflow.so      clanger.c      dump-classes.cpp  source-info.bin
clang1.bin       clanger.cpp    libcashflow.cpp   source-info.cpp
root [67]

root [67] .! pwd
/home/archbox/shared/reflection-root
root [68] 
</pre>
</div>
</div>
</div>
<div id="outline-container-orga777e81" class="outline-4">
<h4 id="orga777e81"><span class="section-number-4">1.4.3</span> Show Math constants</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>5<span class="org-rainbow-delimiters-depth-1">]</span> M_PI
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 3.1415927
root <span class="org-rainbow-delimiters-depth-1">[</span>6<span class="org-rainbow-delimiters-depth-1">]</span> M_E
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 2.7182818
root <span class="org-rainbow-delimiters-depth-1">[</span>7<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>7<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-comment-delimiter">// </span><span class="org-comment">Predefined math constants in the header cmath</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>8<span class="org-rainbow-delimiters-depth-1">]</span> M_E
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 2.7182818
root <span class="org-rainbow-delimiters-depth-1">[</span>9<span class="org-rainbow-delimiters-depth-1">]</span> M_PI
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 3.1415927
root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> M_LOG10E <span class="org-comment-delimiter">// </span><span class="org-comment">Logarithm to base 2 of E</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.43429448
root <span class="org-rainbow-delimiters-depth-1">[</span>11<span class="org-rainbow-delimiters-depth-1">]</span> M_LN10 <span class="org-comment-delimiter">// </span><span class="org-comment">Natural log of 10</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 2.3025851
root <span class="org-rainbow-delimiters-depth-1">[</span>12<span class="org-rainbow-delimiters-depth-1">]</span> M_PI_4 <span class="org-comment-delimiter">// </span><span class="org-comment">PI divided by 4 or PI/4</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.78539816
root <span class="org-rainbow-delimiters-depth-1">[</span>13<span class="org-rainbow-delimiters-depth-1">]</span> M_2_PI <span class="org-comment-delimiter">// </span><span class="org-comment">2 * PI or 360 deg</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.63661977
root <span class="org-rainbow-delimiters-depth-1">[</span>14<span class="org-rainbow-delimiters-depth-1">]</span> M_SQRT2 <span class="org-comment-delimiter">// </span><span class="org-comment">Square root of 2</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 1.4142136
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> M_SQRT1_2
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.70710678
root <span class="org-rainbow-delimiters-depth-1">[</span>16<span class="org-rainbow-delimiters-depth-1">]</span> 
</pre>
</div>
</div>
</div>
<div id="outline-container-org8dfaf34" class="outline-4">
<h4 id="org8dfaf34"><span class="section-number-4">1.4.4</span> Print to stdout</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>20<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Hello world"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
Hello <span class="org-type">world</span>
<span class="org-variable-name">root</span> <span class="org-rainbow-delimiters-depth-1">[</span>21<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>21<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">i</span> = 0 ; i &lt; 10; i++<span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"i = "</span> &lt;&lt; i &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
i = 0
i = 1
i = 2
i = 3
i = 4
i = 5
i = 6
i = 7
i = 8
i = 9

</pre>
</div>
</div>
</div>
<div id="outline-container-orga8facfa" class="outline-4">
<h4 id="orga8facfa"><span class="section-number-4">1.4.5</span> Paste multiline</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">To paste a multi line code, paste the code between brackets</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">To paste a multi line code, paste the code between brackets</span>
  <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-keyword">auto</span> <span class="org-variable-name">func</span> = <span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span>
      <span class="org-keyword">return</span> x * x - 4 * x + 10;
  <span class="org-rainbow-delimiters-depth-2">}</span>;
  <span class="org-rainbow-delimiters-depth-1">}</span>

  root <span class="org-rainbow-delimiters-depth-1">[</span>38<span class="org-rainbow-delimiters-depth-1">]</span> func<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 10.000000
  root <span class="org-rainbow-delimiters-depth-1">[</span>39<span class="org-rainbow-delimiters-depth-1">]</span> 
  root <span class="org-rainbow-delimiters-depth-1">[</span>39<span class="org-rainbow-delimiters-depth-1">]</span> func<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 10.000000
  root <span class="org-rainbow-delimiters-depth-1">[</span>40<span class="org-rainbow-delimiters-depth-1">]</span> func<span class="org-rainbow-delimiters-depth-1">(</span>3<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 7.0000000
  root <span class="org-rainbow-delimiters-depth-1">[</span>41<span class="org-rainbow-delimiters-depth-1">]</span> func<span class="org-rainbow-delimiters-depth-1">(</span>5<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 15.000000
  root <span class="org-rainbow-delimiters-depth-1">[</span>42<span class="org-rainbow-delimiters-depth-1">]</span> func<span class="org-rainbow-delimiters-depth-1">(</span>10<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 70.000000
  root <span class="org-rainbow-delimiters-depth-1">[</span>43<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</div>
