Root-cern-repl.org
*** Playing with STL Vectors

#+BEGIN_SRC cpp 
root [47] std::vector<double> ys {10.0, 3.0, 5.0, 6.0, 10.0, 20.0}
(std::vector<double> &) { 10.000000, 3.0000000, 5.0000000, 6.0000000, 10.000000, 20.000000 }
root [48] 

root [48] ys.size()
(unsigned long) 6
root [49] ys.max_size()
(unsigned long) 2305843009213693951
root [50] ys[0]
(double) 10.000000
root [51] ys[1]
(double) 3.0000000
root [52] ys[2]
(double) 5.0000000
root [53] ys.at(0)
(double) 10.000000
root [54] ys.at(1)
(double) 3.0000000
root [55] ys.at(2)
(double) 5.0000000
root [56] ys.at(100)
Error in <TRint::HandleTermInput()>: std::out_of_range caught: vector::_M_range_check: __n (which is 100) >= this->size() (which is 6)
root [57] 

root [58] ys.push_back(5)
root [59] ys
(std::vector<double> &) { 10.000000, 3.0000000, 5.0000000, 6.0000000, 10.000000, 20.000000, 5.0000000 }
root [60] 

#+END_SRC
*** Playing with Deque - Double Ended Queue STL Container 

#+BEGIN_SRC cpp 
  root [71] std::deque<double> d;
  root [72] d
  (std::deque<double> &) {}

  root [73] d. // Type tab to complete 
  assign
  at
  back
  begin
  cbegin
  cend
  clear
  crbegin
  crend
  ... ... 

  root [73] d.push_back(10.0)
  root [74] d.push_back(3.0)
  root [75] d.push_back(5.0)
  root [76] d
  (std::deque<double> &) { 10.000000, 3.0000000, 5.0000000 }
  root [77] 

  root [83] std::cout << std::fixed << std::setprecision(2)
  (std::basic_ostream<char, std::char_traits<char> > &) @0x7fe94fd0ae20
  root [84] 

  // C++ 11 For-range based loop 
  root [89] for(const auto& x: d){ std::cout << x << std::endl; }
  10.00
  6.00
  10.00
  3.00
  5.00
  root [90] 


  root [88] for(const auto& x: d){ std::cout << std::right << std::setw(10) << x << std::end   
       10.00
        6.00
       10.00
        3.00
        5.00
  root [89] 

  // Clear 
  root [97] d.clear()
  root [98] d
  (std::deque<double> &) {}
  root [99] 


#+END_SRC
