Root-cern-repl.html
<div id="outline-container-orgb7d3509" class="outline-4">
<h4 id="orgb7d3509"><span class="section-number-4">1.4.6</span> Playing with STL Vectors</h4>
<div class="outline-text-4" id="text-1-4-6">
<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>47<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> ys <span class="org-rainbow-delimiters-depth-1">{</span>10.0, 3.0, 5.0, 6.0, 10.0, 20.0<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> 10.000000, 3.0000000, 5.0000000, 6.0000000, 10.000000, 20.000000 <span class="org-rainbow-delimiters-depth-1">}</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>48<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>48<span class="org-rainbow-delimiters-depth-1">]</span> ys.size<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">long</span><span class="org-rainbow-delimiters-depth-1">)</span> 6
root <span class="org-rainbow-delimiters-depth-1">[</span>49<span class="org-rainbow-delimiters-depth-1">]</span> ys.max_size<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">unsigned</span> <span class="org-type">long</span><span class="org-rainbow-delimiters-depth-1">)</span> 2305843009213693951
root <span class="org-rainbow-delimiters-depth-1">[</span>50<span class="org-rainbow-delimiters-depth-1">]</span> ys<span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 10.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>51<span class="org-rainbow-delimiters-depth-1">]</span> ys<span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 3.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>52<span class="org-rainbow-delimiters-depth-1">]</span> ys<span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 5.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>53<span class="org-rainbow-delimiters-depth-1">]</span> ys.at<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 10.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>54<span class="org-rainbow-delimiters-depth-1">]</span> ys.at<span class="org-rainbow-delimiters-depth-1">(</span>1<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 3.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>55<span class="org-rainbow-delimiters-depth-1">]</span> ys.at<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 5.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>56<span class="org-rainbow-delimiters-depth-1">]</span> ys.at<span class="org-rainbow-delimiters-depth-1">(</span>100<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">Error</span> <span class="org-type">in</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">TRint</span>::HandleTermInput<span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>: <span class="org-constant">std</span>::out_of_range caught: <span class="org-constant">vector</span>::_M_range_check: __n <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">which</span> <span class="org-variable-name">is</span> 100<span class="org-rainbow-delimiters-depth-1">)</span> &gt;= <span class="org-keyword">this</span>-&gt;size<span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">which</span> <span class="org-variable-name">is</span> 6<span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>57<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>58<span class="org-rainbow-delimiters-depth-1">]</span> ys.push_back<span class="org-rainbow-delimiters-depth-1">(</span>5<span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>59<span class="org-rainbow-delimiters-depth-1">]</span> ys
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> 10.000000, 3.0000000, 5.0000000, 6.0000000, 10.000000, 20.000000, 5.0000000 <span class="org-rainbow-delimiters-depth-1">}</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>60<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</div>
<div id="outline-container-org9f7bad1" class="outline-4">
<h4 id="org9f7bad1"><span class="section-number-4">1.4.7</span> Playing with Deque - Double Ended Queue STL Container</h4>
<div class="outline-text-4" id="text-1-4-7">
<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>71<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> d;
root <span class="org-rainbow-delimiters-depth-1">[</span>72<span class="org-rainbow-delimiters-depth-1">]</span> d
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{}</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>73<span class="org-rainbow-delimiters-depth-1">]</span> d. <span class="org-comment-delimiter">// </span><span class="org-comment">Type tab to complete </span>
assign
at
back
begin
cbegin
cend
clear
crbegin
crend
... ... 

root <span class="org-rainbow-delimiters-depth-1">[</span>73<span class="org-rainbow-delimiters-depth-1">]</span> d.push_back<span class="org-rainbow-delimiters-depth-1">(</span>10.0<span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>74<span class="org-rainbow-delimiters-depth-1">]</span> d.push_back<span class="org-rainbow-delimiters-depth-1">(</span>3.0<span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>75<span class="org-rainbow-delimiters-depth-1">]</span> d.push_back<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>76<span class="org-rainbow-delimiters-depth-1">]</span> d
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> 10.000000, 3.0000000, 5.0000000 <span class="org-rainbow-delimiters-depth-1">}</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>77<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>83<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">basic_ostream</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">char</span>, <span class="org-constant">std</span>::<span class="org-type">char_traits</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">char</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fe94fd0ae20
root <span class="org-rainbow-delimiters-depth-1">[</span>84<span class="org-rainbow-delimiters-depth-1">]</span> 

<span class="org-comment-delimiter">// </span><span class="org-comment">C++ 11 For-range based loop </span>
root <span class="org-rainbow-delimiters-depth-1">[</span>89<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: d<span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-constant">std</span>::cout &lt;&lt; x &lt;&lt; <span class="org-constant">std</span>::endl; <span class="org-rainbow-delimiters-depth-1">}</span>
10.00
6.00
10.00
3.00
5.00
root <span class="org-rainbow-delimiters-depth-1">[</span>90<span class="org-rainbow-delimiters-depth-1">]</span> 


root <span class="org-rainbow-delimiters-depth-1">[</span>88<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: d<span class="org-rainbow-delimiters-depth-1">){</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::right &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; x &lt;&lt; <span class="org-constant">std</span>::end   
     10.00
      6.00
     10.00
      3.00
      5.00
root <span class="org-rainbow-delimiters-depth-2">[</span>89<span class="org-rainbow-delimiters-depth-2">]</span> 

<span class="org-comment-delimiter">// </span><span class="org-comment">Clear </span>
root <span class="org-rainbow-delimiters-depth-2">[</span>97<span class="org-rainbow-delimiters-depth-2">]</span> d.clear<span class="org-rainbow-delimiters-depth-2">()</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>98<span class="org-rainbow-delimiters-depth-2">]</span> d
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">deque</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>99<span class="org-rainbow-delimiters-depth-2">]</span> 


</pre>
</div>
</div>
</div>
