Root-cern-repl.org
*** Playing with STL Maps 

STL Map (dictionary, hash map) container: 

#+BEGIN_SRC cpp 

  // Create a map container with uniform initialization 
  root [1] std::map<std::string, double> constants {{"pi", 3.1415}, {"earth_gravity", 9.81},(std::map<std::string, double> &) 
          { "earth_gravity" => 9.8100000, "pi" => 3.1415000, "sqrt_2" => 1.4170000 }
  root [2] 
  root [2] 

  root [5] constants["earth_gravity"]
  (double) 9.8100000
  root [6] 
  root [6] constants.at("earth_gravity")
  (double) 9.8100000

  // Generate exception 
  root [7] constants.at("pi")
  (double) 3.1415000
  root [8] constants.at("pix")
  Error in <TRint::HandleTermInput()>: std::out_of_range caught: map::at
  root [9] 

  root [9] constants.size()
  (unsigned long) 4
  root [10] 
  root [10] 

  root [11] constants.clear()
  root [12] 
  root [12] constants
  (std::map<std::string, double> &) {}
  root [13] 

  root [15] constants.insert(std::pair<std::string, double>("pi", 3.1415))
  root [17] constants.insert(std::pair<std::string, double>("x", 10.0))

  root [18] constants
  (std::map<std::string, double> &) { "pi" => 3.1415000, "x" => 10.000000 }
  root [19] 

  {
  for(const auto& x: constants){
          cout << "key   = " << std::setw(4) << x.first << std::setw(10)
               << "value = " << x.second << endl;
      }
  }
  // Output 
  key   =   pi  value = 3.1415
  key   =    x  value = 10

#+END_SRC
*** Playing with classes 
