Root-cern-repl.html
<div id="outline-container-orgd0809be" class="outline-4">
<h4 id="orgd0809be"><span class="section-number-4">1.4.8</span> Playing with STL Maps</h4>
<div class="outline-text-4" id="text-1-4-8">
<p>
STL Map (dictionary, hash map) container: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">
<span class="org-comment-delimiter">// </span><span class="org-comment">Create a map container with uniform initialization </span>
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> constants <span class="org-rainbow-delimiters-depth-1">{</span><span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"pi"</span>, 3.1415<span class="org-rainbow-delimiters-depth-2">}</span>, <span class="org-rainbow-delimiters-depth-2">{</span><span class="org-string">"earth_gravity"</span>, 9.81<span class="org-rainbow-delimiters-depth-2">}</span>,<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-2">)</span> 
        <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-string">"earth_gravity"</span> =&gt; 9.8100000, <span class="org-string">"pi"</span> =&gt; 3.1415000, <span class="org-string">"sqrt_2"</span> =&gt; 1.4170000 <span class="org-rainbow-delimiters-depth-2">}</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>2<span class="org-rainbow-delimiters-depth-2">]</span> 
root <span class="org-rainbow-delimiters-depth-2">[</span>2<span class="org-rainbow-delimiters-depth-2">]</span> 

root <span class="org-rainbow-delimiters-depth-2">[</span>5<span class="org-rainbow-delimiters-depth-2">]</span> constants<span class="org-rainbow-delimiters-depth-2">[</span><span class="org-string">"earth_gravity"</span><span class="org-rainbow-delimiters-depth-2">]</span>
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">)</span> 9.8100000
root <span class="org-rainbow-delimiters-depth-2">[</span>6<span class="org-rainbow-delimiters-depth-2">]</span> 
root <span class="org-rainbow-delimiters-depth-2">[</span>6<span class="org-rainbow-delimiters-depth-2">]</span> constants.at<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"earth_gravity"</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">)</span> 9.8100000

<span class="org-comment-delimiter">// </span><span class="org-comment">Generate exception </span>
root <span class="org-rainbow-delimiters-depth-2">[</span>7<span class="org-rainbow-delimiters-depth-2">]</span> constants.at<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"pi"</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">)</span> 3.1415000
root <span class="org-rainbow-delimiters-depth-2">[</span>8<span class="org-rainbow-delimiters-depth-2">]</span> constants.at<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"pix"</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-type">Error</span> <span class="org-type">in</span> <span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-constant">TRint</span>::HandleTermInput<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>: <span class="org-constant">std</span>::out_of_range caught: <span class="org-constant">map</span>::at
root <span class="org-rainbow-delimiters-depth-2">[</span>9<span class="org-rainbow-delimiters-depth-2">]</span> 

root <span class="org-rainbow-delimiters-depth-2">[</span>9<span class="org-rainbow-delimiters-depth-2">]</span> constants.size<span class="org-rainbow-delimiters-depth-2">()</span>
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">unsigned</span> <span class="org-type">long</span><span class="org-rainbow-delimiters-depth-2">)</span> 4
root <span class="org-rainbow-delimiters-depth-2">[</span>10<span class="org-rainbow-delimiters-depth-2">]</span> 
root <span class="org-rainbow-delimiters-depth-2">[</span>10<span class="org-rainbow-delimiters-depth-2">]</span> 

root <span class="org-rainbow-delimiters-depth-2">[</span>11<span class="org-rainbow-delimiters-depth-2">]</span> constants.clear<span class="org-rainbow-delimiters-depth-2">()</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>12<span class="org-rainbow-delimiters-depth-2">]</span> 
root <span class="org-rainbow-delimiters-depth-2">[</span>12<span class="org-rainbow-delimiters-depth-2">]</span> constants
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>13<span class="org-rainbow-delimiters-depth-2">]</span> 

root <span class="org-rainbow-delimiters-depth-2">[</span>15<span class="org-rainbow-delimiters-depth-2">]</span> constants.insert<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::pair<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span><span class="org-string">"pi"</span>, 3.1415<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>17<span class="org-rainbow-delimiters-depth-2">]</span> constants.insert<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::pair<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span><span class="org-string">"x"</span>, 10.0<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>

root <span class="org-rainbow-delimiters-depth-2">[</span>18<span class="org-rainbow-delimiters-depth-2">]</span> constants
<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">map</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-constant">std</span>::string, <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-string">"pi"</span> =&gt; 3.1415000, <span class="org-string">"x"</span> =&gt; 10.000000 <span class="org-rainbow-delimiters-depth-2">}</span>
root <span class="org-rainbow-delimiters-depth-2">[</span>19<span class="org-rainbow-delimiters-depth-2">]</span> 

<span class="org-rainbow-delimiters-depth-2">{</span>
<span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: constants<span class="org-rainbow-delimiters-depth-3">){</span>
        cout &lt;&lt; <span class="org-string">"key   = "</span> &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>4<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; x.first &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>10<span class="org-rainbow-delimiters-depth-4">)</span>
             &lt;&lt; <span class="org-string">"value = "</span> &lt;&lt; x.second &lt;&lt; endl;
    <span class="org-rainbow-delimiters-depth-3">}</span>
<span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Output </span>
key   =   pi  value = 3.1415
key   =    x  value = 10

</pre>
</div>
</div>
</div>
<div id="outline-container-org924160e" class="outline-4">
<h4 id="org924160e"><span class="section-number-4">1.4.9</span> Playing with classes</h4>
<div class="outline-text-4" id="text-1-4-9">
</div>
<ol class="org-ol">
