Root-cern-repl.org
**** CashFlow class

ROOT Cling can also play with C++ classes as they were ordinary
scripts. 

File: CashFlow.cpp 

#+BEGIN_SRC cpp 
  #include <iostream>
  #include <vector>
  #include <initializer_list>
  #include <iomanip> // setw, setpreicision ...

  class CashFlow{
  private:
     std::vector<double> m_pmt;
  public:
      // Default constructor - doesn't
      CashFlow(){}

      // Overloaded contructor with vector
      CashFlow(std::vector<double> pmt){
          m_pmt.insert(m_pmt.begin(), pmt.begin(), pmt.end());
      }
      // Overloaded constructor with initializer list
      CashFlow(std::initializer_list<double> pmt){
          m_pmt.insert(m_pmt.begin(), pmt.begin(), pmt.end());
      }
      CashFlow& add(double x){
          m_pmt.push_back(x);
          return *this;
      }
      void show(){
          int i = 0;
          for(const auto& x: m_pmt){
              std::cout << std::setw(10) << i
                        << std::setw(10) << std::setprecision(3) << std::fixed << x
                        << std::endl;
              ++i;
          }
      }

  };
#+END_SRC


In the ROOT shell: 

#+BEGIN_SRC cpp 
  root [0] .L CashFlow.cpp 

  root [1] CashFlow clf;

  root [2] clf.show()

  root [3] clf.add(-30).add(20).add(4).add(5).add(25)
  (CashFlow &) @0x7fa4df246010
  root [4] clf.show()
           0   -30.000
           1    20.000
           2     4.000
           3     5.000
           4    25.000

  root [6] 
  root [6] CashFlow clf2 {-30.0, 20.0, 3.0, 5.0, 25.0} ;
  root [7] clf2.show()
           0   -30.000
           1    20.000
           2     3.000
           3     5.000
           4    25.000
  root [8] 

#+END_SRC
