Root-cern-repl.html
<li><a id="org0b1c613"></a>CashFlow class<br />
<div class="outline-text-5" id="text-1-4-9-1">
<p>
ROOT Cling can also play with C++ classes as they were ordinary
scripts. 
</p>

<p>
File: CashFlow.cpp 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">vector</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">initializer_list</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iomanip</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> <span class="org-comment-delimiter">// </span><span class="org-comment">setw, setpreicision ...</span>

<span class="org-keyword">class</span> <span class="org-type">CashFlow</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">private</span>:
   <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">m_pmt</span>;
<span class="org-function-name">public</span>:
    <span class="org-comment-delimiter">// </span><span class="org-comment">Default constructor - doesn't</span>
    <span class="org-function-name">CashFlow</span><span class="org-rainbow-delimiters-depth-2">(){}</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">Overloaded contructor with vector</span>
    <span class="org-function-name">CashFlow</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">pmt</span><span class="org-rainbow-delimiters-depth-2">){</span>
        m_pmt.insert<span class="org-rainbow-delimiters-depth-3">(</span>m_pmt.begin<span class="org-rainbow-delimiters-depth-4">()</span>, pmt.begin<span class="org-rainbow-delimiters-depth-4">()</span>, pmt.end<span class="org-rainbow-delimiters-depth-4">()</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">Overloaded constructor with initializer list</span>
    <span class="org-function-name">CashFlow</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">initializer_list</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">pmt</span><span class="org-rainbow-delimiters-depth-2">){</span>
        m_pmt.insert<span class="org-rainbow-delimiters-depth-3">(</span>m_pmt.begin<span class="org-rainbow-delimiters-depth-4">()</span>, pmt.begin<span class="org-rainbow-delimiters-depth-4">()</span>, pmt.end<span class="org-rainbow-delimiters-depth-4">()</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">CashFlow</span>&amp; <span class="org-function-name">add</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span>
        m_pmt.push_back<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-keyword">return</span> *<span class="org-keyword">this</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">void</span> <span class="org-function-name">show</span><span class="org-rainbow-delimiters-depth-2">(){</span>
        <span class="org-type">int</span> <span class="org-variable-name">i</span> = 0;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">const</span> <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: m_pmt<span class="org-rainbow-delimiters-depth-3">){</span>
            <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>10<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; i
                      &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-4">(</span>10<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; <span class="org-constant">std</span>::setprecision<span class="org-rainbow-delimiters-depth-4">(</span>3<span class="org-rainbow-delimiters-depth-4">)</span> &lt;&lt; <span class="org-constant">std</span>::fixed &lt;&lt; x
                      &lt;&lt; <span class="org-constant">std</span>::endl;
            ++i;
        <span class="org-rainbow-delimiters-depth-3">}</span>
    <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>


<p>
In the ROOT shell: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> .L CashFlow.cpp 

root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> CashFlow clf;

root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> clf.show<span class="org-rainbow-delimiters-depth-1">()</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> clf.add<span class="org-rainbow-delimiters-depth-1">(</span>-30<span class="org-rainbow-delimiters-depth-1">)</span>.add<span class="org-rainbow-delimiters-depth-1">(</span>20<span class="org-rainbow-delimiters-depth-1">)</span>.add<span class="org-rainbow-delimiters-depth-1">(</span>4<span class="org-rainbow-delimiters-depth-1">)</span>.add<span class="org-rainbow-delimiters-depth-1">(</span>5<span class="org-rainbow-delimiters-depth-1">)</span>.add<span class="org-rainbow-delimiters-depth-1">(</span>25<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">CashFlow</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fa4df246010
root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> clf.show<span class="org-rainbow-delimiters-depth-1">()</span>
         0   -30.000
         1    20.000
         2     4.000
         3     5.000
         4    25.000

root <span class="org-rainbow-delimiters-depth-1">[</span>6<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>6<span class="org-rainbow-delimiters-depth-1">]</span> CashFlow clf2 <span class="org-rainbow-delimiters-depth-1">{</span>-30.0, 20.0, 3.0, 5.0, 25.0<span class="org-rainbow-delimiters-depth-1">}</span> ;
root <span class="org-rainbow-delimiters-depth-1">[</span>7<span class="org-rainbow-delimiters-depth-1">]</span> clf2.show<span class="org-rainbow-delimiters-depth-1">()</span>
         0   -30.000
         1    20.000
         2     3.000
         3     5.000
         4    25.000
root <span class="org-rainbow-delimiters-depth-1">[</span>8<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</li>
