Root-cern-repl.org
**** Linear function class 

ROOT Session:

#+BEGIN_SRC cpp 
  root [0] .L linfun.cpp 
  root [1] 
  root [1] LinearFunction lfun1(3.0, 4.0)
  (LinearFunction &) @0x7fac4d729010
  root [2] lfun1
  (LinearFunction &) @0x7fac4d729010
  root [3] std::cout << lfun1 << std::endl;
  y(x) = 3.000 * x + 4.000
  root [4] 
  root [4] lfun1(3.0)
  (double) 13.000000
  root [5] lfun1(0)
  (double) 4.0000000
  root [6] lfun1(5)
  (double) 19.000000
  root [7] lfun1(10)
  (double) 34.000000
  root [8] lfun1.setCoeffs(5.0, 10.0);
  root [9] 
  root [9] std::cout << lfun1 << std::endl;
  y(x) = 5.000 * x + 10.000
  root [10] 
  root [10] std::vector<double> xs{3.0, 4.0, 5.0, 6.0, 5.0};
  root [11] 
  root [11] xs
  (std::vector<double> &) { 3.0000000, 4.0000000, 5.0000000, 6.0000000, 5.0000000 }
  root [12] 
  root [12] lfun1(xs)
  (std::vector<double>) { 25.000000, 30.000000, 35.000000, 40.000000, 35.000000 }
  root [13] 
  root [13] auto lfun2 = LinearFunction::fromPoints(2, 9, 8 , 21);
  root [14] std::cout << lfun2 << std::endl;
  y(x) = 2.000 * x + 5.000
  root [15] 
  root [15] lfun2(3.0) 
  (double) 11.000000
  root [16] lfun2(4.0) 
  (double) 13.000000
  root [17] lfun2(5.0) 
  (double) 15.000000
  root [18] 

#+END_SRC

File: linfun.cpp

#+BEGIN_SRC cpp 
  class LinearFunction{
  public:
      LinearFunction(double a, double b): A(a), B(b) {}

      /* Named constructor, aka static factory method*/
      static LinearFunction fromCoeffs(double a, double b){
          return LinearFunction(a, b);
      }   
      /* Named constructor, aka static factory method*/
      static LinearFunction fromPoints(double x1, double y1, double x2, double y2){
          double a = (y2 - y1)/(x2 - x1);
          double b = y1 - a * x1;
          return LinearFunction(a, b);
      }

      double eval(double x){
          return A * x + B;
      }

      // Function-call-operator overload
      // Using the New C++11 return type
      // It could also be:
      //  >> double operator()(double x){ ... 
      auto operator()(double x) -> double{
          return A * x + B;
      }   
      // Function-call-operator overload
      std::vector<double> operator()(const std::vector<double>& xs){
          std::vector<double> res;
          for(auto& x: xs){
              res.push_back(A * x + B);
          }
          return res;
      }   
      void setCoeffs(double A, double B){
          this->A = A;
          this->B = B;
      }
      void setA(double a){
          A = a;
      }
      void setB(double b){
          B = b;
      }
      // The stream insertion operator (<<) is not a method 
      // (member function) of this class. It is a overload of 
      // the operator (<<) for the class std::ostream which is
      // a generic output stream.
      friend std::ostream& operator<<(std::ostream &os, const LinearFunction& lfun){
          os.precision(3);
          os.setf(std::ios::fixed);
          os << "y(x) = " << lfun.A << " * x" << " + " << lfun.B;
          return os;
      }
  private:
      double A;
      double B;
  }; //---- End of object LinearFunction --- //

  /** Makes the vector printable, similar to implementing vector.toString in Java */
  std::ostream& operator << (std::ostream &os, const std::vector<double>& xs){
      os << "[" << xs.size() << "](" ;
      copy(xs.begin(), xs.end(), std::ostream_iterator<double>(os, " "));
      os << ")";
      return os;
  }
#+END_SRC

