Root-cern-repl.html
<li><a id="org4e5e8e4"></a>Linear function class<br />
<div class="outline-text-5" id="text-1-4-9-2">
<p>
ROOT Session:
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> .L linfun.cpp 
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> LinearFunction lfun1<span class="org-rainbow-delimiters-depth-1">(</span>3.0, 4.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">LinearFunction</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fac4d729010
root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> lfun1
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">LinearFunction</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fac4d729010
root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::cout &lt;&lt; lfun1 &lt;&lt; <span class="org-constant">std</span>::endl;
y<span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span> = 3.000 * x + 4.000
root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> lfun1<span class="org-rainbow-delimiters-depth-1">(</span>3.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 13.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>5<span class="org-rainbow-delimiters-depth-1">]</span> lfun1<span class="org-rainbow-delimiters-depth-1">(</span>0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 4.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>6<span class="org-rainbow-delimiters-depth-1">]</span> lfun1<span class="org-rainbow-delimiters-depth-1">(</span>5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 19.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>7<span class="org-rainbow-delimiters-depth-1">]</span> lfun1<span class="org-rainbow-delimiters-depth-1">(</span>10<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 34.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>8<span class="org-rainbow-delimiters-depth-1">]</span> lfun1.setCoeffs<span class="org-rainbow-delimiters-depth-1">(</span>5.0, 10.0<span class="org-rainbow-delimiters-depth-1">)</span>;
root <span class="org-rainbow-delimiters-depth-1">[</span>9<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>9<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::cout &lt;&lt; lfun1 &lt;&lt; <span class="org-constant">std</span>::endl;
y<span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span> = 5.000 * x + 10.000
root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> xs<span class="org-rainbow-delimiters-depth-1">{</span>3.0, 4.0, 5.0, 6.0, 5.0<span class="org-rainbow-delimiters-depth-1">}</span>;
root <span class="org-rainbow-delimiters-depth-1">[</span>11<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>11<span class="org-rainbow-delimiters-depth-1">]</span> xs
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> 3.0000000, 4.0000000, 5.0000000, 6.0000000, 5.0000000 <span class="org-rainbow-delimiters-depth-1">}</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>12<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>12<span class="org-rainbow-delimiters-depth-1">]</span> lfun1<span class="org-rainbow-delimiters-depth-1">(</span>xs<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> 25.000000, 30.000000, 35.000000, 40.000000, 35.000000 <span class="org-rainbow-delimiters-depth-1">}</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>13<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>13<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">auto</span> lfun2 = <span class="org-constant">LinearFunction</span>::fromPoints<span class="org-rainbow-delimiters-depth-1">(</span>2, 9, 8 , 21<span class="org-rainbow-delimiters-depth-1">)</span>;
root <span class="org-rainbow-delimiters-depth-1">[</span>14<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::cout &lt;&lt; lfun2 &lt;&lt; <span class="org-constant">std</span>::endl;
y<span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span> = 2.000 * x + 5.000
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> lfun2<span class="org-rainbow-delimiters-depth-1">(</span>3.0<span class="org-rainbow-delimiters-depth-1">)</span> 
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 11.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>16<span class="org-rainbow-delimiters-depth-1">]</span> lfun2<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span> 
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 13.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>17<span class="org-rainbow-delimiters-depth-1">]</span> lfun2<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span> 
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 15.000000
root <span class="org-rainbow-delimiters-depth-1">[</span>18<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>

<p>
File: linfun.cpp
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">class</span> <span class="org-type">LinearFunction</span><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-function-name">public</span>:
    <span class="org-function-name">LinearFunction</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-2">)</span>: A<span class="org-rainbow-delimiters-depth-2">(</span>a<span class="org-rainbow-delimiters-depth-2">)</span>, B<span class="org-rainbow-delimiters-depth-2">(</span>b<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>

    <span class="org-comment-delimiter">/* </span><span class="org-comment">Named constructor, aka static factory method*/</span>
    <span class="org-keyword">static</span> <span class="org-type">LinearFunction</span> <span class="org-function-name">fromCoeffs</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-keyword">return</span> LinearFunction<span class="org-rainbow-delimiters-depth-3">(</span>a, b<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>   
    <span class="org-comment-delimiter">/* </span><span class="org-comment">Named constructor, aka static factory method*/</span>
    <span class="org-keyword">static</span> <span class="org-type">LinearFunction</span> <span class="org-function-name">fromPoints</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x1</span>, <span class="org-type">double</span> <span class="org-variable-name">y1</span>, <span class="org-type">double</span> <span class="org-variable-name">x2</span>, <span class="org-type">double</span> <span class="org-variable-name">y2</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-type">double</span> <span class="org-variable-name">a</span> = <span class="org-rainbow-delimiters-depth-3">(</span>y2 - y1<span class="org-rainbow-delimiters-depth-3">)</span>/<span class="org-rainbow-delimiters-depth-3">(</span>x2 - x1<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-type">double</span> <span class="org-variable-name">b</span> = y1 - a * x1;
        <span class="org-keyword">return</span> LinearFunction<span class="org-rainbow-delimiters-depth-3">(</span>a, b<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

    <span class="org-type">double</span> <span class="org-function-name">eval</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-keyword">return</span> A * x + B;
    <span class="org-rainbow-delimiters-depth-2">}</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">Function-call-operator overload</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">Using the New C++11 return type</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">It could also be:</span>
    <span class="org-comment-delimiter">//  </span><span class="org-comment">&gt;&gt; double operator()(double x){ ... </span>
    <span class="org-keyword">auto</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">return</span> A * x + B;
    <span class="org-rainbow-delimiters-depth-2">}</span>   
    <span class="org-comment-delimiter">// </span><span class="org-comment">Function-call-operator overload</span>
    <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span> <span class="org-variable-name">res</span>;
        <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">auto</span>&amp; <span class="org-variable-name">x</span>: xs<span class="org-rainbow-delimiters-depth-3">){</span>
            res.push_back<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-type">A</span> * <span class="org-variable-name">x</span> + B<span class="org-rainbow-delimiters-depth-4">)</span>;
        <span class="org-rainbow-delimiters-depth-3">}</span>
        <span class="org-keyword">return</span> res;
    <span class="org-rainbow-delimiters-depth-2">}</span>   
    <span class="org-type">void</span> <span class="org-function-name">setCoeffs</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">A</span>, <span class="org-type">double</span> <span class="org-variable-name">B</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-keyword">this</span>-&gt;A = A;
        <span class="org-keyword">this</span>-&gt;B = B;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">void</span> <span class="org-function-name">setA</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span><span class="org-rainbow-delimiters-depth-2">){</span>
        A = a;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-type">void</span> <span class="org-function-name">setB</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-2">){</span>
        B = b;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">The stream insertion operator (&lt;&lt;) is not a method </span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">(member function) of this class. It is a overload of </span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">the operator (&lt;&lt;) for the class std::ostream which is</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">a generic output stream.</span>
    <span class="org-keyword">friend</span> <span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-keyword">operator</span><span class="org-function-name">&lt;&lt;</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-type">ostream</span> &amp;<span class="org-variable-name">os</span>, <span class="org-keyword">const</span> <span class="org-type">LinearFunction</span>&amp; <span class="org-variable-name">lfun</span><span class="org-rainbow-delimiters-depth-2">){</span>
        os.precision<span class="org-rainbow-delimiters-depth-3">(</span>3<span class="org-rainbow-delimiters-depth-3">)</span>;
        os.setf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">std</span>::<span class="org-constant">ios</span>::fixed<span class="org-rainbow-delimiters-depth-3">)</span>;
        os &lt;&lt; <span class="org-string">"y(x) = "</span> &lt;&lt; lfun.A &lt;&lt; <span class="org-string">" * x"</span> &lt;&lt; <span class="org-string">" + "</span> &lt;&lt; lfun.B;
        <span class="org-keyword">return</span> os;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-function-name">private</span>:
    <span class="org-type">double</span> <span class="org-variable-name">A</span>;
    <span class="org-type">double</span> <span class="org-variable-name">B</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>; <span class="org-comment-delimiter">//</span><span class="org-comment">---- End of object LinearFunction --- //</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Makes the vector printable, similar to implementing vector.toString in Java */</span>
<span class="org-function-name">std</span>::ostream&amp; <span class="org-keyword">operator</span> &lt;&lt; <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">ostream</span> &amp;<span class="org-variable-name">os</span>, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>&amp; <span class="org-variable-name">xs</span><span class="org-rainbow-delimiters-depth-1">){</span>
    os &lt;&lt; <span class="org-string">"["</span> &lt;&lt; xs.size<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-string">"]("</span> ;
    copy<span class="org-rainbow-delimiters-depth-2">(</span>xs.begin<span class="org-rainbow-delimiters-depth-3">()</span>, xs.end<span class="org-rainbow-delimiters-depth-3">()</span>, <span class="org-constant">std</span>::ostream_iterator<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>os, <span class="org-string">" "</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    os &lt;&lt; <span class="org-string">")"</span>;
    <span class="org-keyword">return</span> os;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
