Root-cern-repl.org
*** Playing with higher order functions and C++11 lambdas

To load the following code, just copy and then paste it in the ROOT
REPL. 

#+BEGIN_SRC cpp 
  // Type synonym to avoid repeating it.
  // Equivalent to typedef std::function<double (double)> MathFun 
  using MathFun = std::function<double (double)>;

  /** Higher order function to tabulate ordinary function 
    ,* The first parameter can be a ordinary lambda function or 
    ,* a any function object implementing  double operator()(double x)
    ,* or  operator()(double) => double Using Scala's notation.
    ,*/
  void tabulate(
      std::function<double (double)> fn,
      double start,
      double stop,
      double step,
      std::ostream& os = std::cout
      ){      
      os.precision(3);
      os.flags(std::ios::fixed);
      os << std::setw(10) << "Input" << std::setw(10) << "Output" << std::endl;
      double x = start;
      while(x <= stop){
          os << std::setw(10) << x << std::setw(10) << fn(x) << std::endl;
          x = x + step;
      }
  }
#+END_SRC

Running: 

#+BEGIN_SRC cpp 
root [40] tabulate([](double x){ return sqrt(x);}, -4.0, 9.0, 1.0)
     Input    Output
    -4.000      -nan
    -3.000      -nan
    -2.000      -nan
    -1.000      -nan
     0.000     0.000
     1.000     1.000
     2.000     1.414
     3.000     1.732
     4.000     2.000
     5.000     2.236
     6.000     2.449
     7.000     2.646
     8.000     2.828
     9.000     3.000
root [41] 

MathFun makeLinFun(double a, double b)  {
    // [=] means -> capture a and b by value 
    return [=](double x){return a * x + b; };
}

root [70] tabulate(makeLinFun(10.0, 5.0), -5, 5, 1)
     Input    Output
    -5.000   -45.000
    -4.000   -35.000
    -3.000   -25.000
    -2.000   -15.000
    -1.000    -5.000
     0.000     5.000
     1.000    15.000
     2.000    25.000
     3.000    35.000
     4.000    45.000
     5.000    55.000
root [71] 

#+END_SRC

*** Playing with STL algorithms 

Required headers: <iostram> and <algorithm> (~std::for_each~)

 - C Arrays 

#+BEGIN_SRC cpp 
  root [0] double xs [] = {10.0, 5.0, 6.0, 3.0}
  (double [4]) { 10.000000, 5.0000000, 6.0000000, 3.0000000 }
  root [1] 
  root [1] std::for_each(xs, xs + 4, [](double x){ std::cout << sqrt(x) << " " << '\n' << std::flush;} );
  3.16228 
  2.23607 
  2.44949 
  1.73205 
  root [2] 
#+END_SRC

 - C++ Vectors 

#+BEGIN_SRC cpp 
  root [0] std::vector<double> vec { 10.0, 3.0, 5.0, 2.0, -6.0} ;
  root [1] xs

  root [3] std::for_each(vec.begin(), vec.end(), [](double x){ std::cout << sqrt(x) << std::endl;})
  3.16228
  1.73205
  2.23607
  1.41421
  -nan
  ((lambda)) @0x1a42030

  root [4] std::for_each(vec.begin(), vec.end(), [](double x){ std::cout << sqrt(x) << std::endl;});
  3.16228
  1.73205
  2.23607
  1.41421
  -nan

#+END_SRC

