Root-cern-repl.html

<div id="outline-container-org2394c6d" class="outline-4">
<h4 id="org2394c6d"><span class="section-number-4">1.4.10</span> Playing with higher order functions and C++11 lambdas</h4>
<div class="outline-text-4" id="text-1-4-10">
<p>
To load the following code, just copy and then paste it in the ROOT
REPL. 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Type synonym to avoid repeating it.</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Equivalent to typedef std::function&lt;double (double)&gt; MathFun </span>
<span class="org-keyword">using</span> <span class="org-type">MathFun</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Higher order function to tabulate ordinary function </span>
<span class="org-comment">  * The first parameter can be a ordinary lambda function or </span>
<span class="org-comment">  * a any function object implementing  double operator()(double x)</span>
<span class="org-comment">  * or  operator()(double) =&gt; double Using Scala's notation.</span>
<span class="org-comment">  */</span>
<span class="org-type">void</span> <span class="org-function-name">tabulate</span><span class="org-rainbow-delimiters-depth-1">(</span>
    <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">fn</span>,
    <span class="org-type">double</span> <span class="org-variable-name">start</span>,
    <span class="org-type">double</span> <span class="org-variable-name">stop</span>,
    <span class="org-type">double</span> <span class="org-variable-name">step</span>,
    <span class="org-constant">std</span>::<span class="org-type">ostream</span>&amp; <span class="org-variable-name">os</span> = <span class="org-constant">std</span>::cout
    <span class="org-rainbow-delimiters-depth-1">){</span>      
    os.precision<span class="org-rainbow-delimiters-depth-2">(</span>3<span class="org-rainbow-delimiters-depth-2">)</span>;
    os.flags<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::<span class="org-constant">ios</span>::fixed<span class="org-rainbow-delimiters-depth-2">)</span>;
    os &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"Input"</span> &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-2">(</span>10<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"Output"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-type">double</span> <span class="org-variable-name">x</span> = start;
    <span class="org-keyword">while</span><span class="org-rainbow-delimiters-depth-2">(</span>x &lt;= stop<span class="org-rainbow-delimiters-depth-2">){</span>
        os &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-3">(</span>10<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; x &lt;&lt; <span class="org-constant">std</span>::setw<span class="org-rainbow-delimiters-depth-3">(</span>10<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; fn<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        x = x + step;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Running: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>40<span class="org-rainbow-delimiters-depth-1">]</span> tabulate<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> sqrt<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;<span class="org-rainbow-delimiters-depth-2">}</span>, -4.0, 9.0, 1.0<span class="org-rainbow-delimiters-depth-1">)</span>
     <span class="org-type">Input</span>    <span class="org-variable-name">Output</span>
    -4.000      -nan
    -3.000      -nan
    -2.000      -nan
    -1.000      -nan
     0.000     0.000
     1.000     1.000
     2.000     1.414
     3.000     1.732
     4.000     2.000
     5.000     2.236
     6.000     2.449
     7.000     2.646
     8.000     2.828
     9.000     3.000
root <span class="org-rainbow-delimiters-depth-1">[</span>41<span class="org-rainbow-delimiters-depth-1">]</span> 

MathFun makeLinFun<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-1">)</span>  <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">[=] means -&gt; capture a and b by value </span>
    <span class="org-keyword">return</span> <span class="org-rainbow-delimiters-depth-2">[</span>=<span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span><span class="org-keyword">return</span> a * x + b; <span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>70<span class="org-rainbow-delimiters-depth-1">]</span> tabulate<span class="org-rainbow-delimiters-depth-1">(</span>makeLinFun<span class="org-rainbow-delimiters-depth-2">(</span>10.0, 5.0<span class="org-rainbow-delimiters-depth-2">)</span>, -5, 5, 1<span class="org-rainbow-delimiters-depth-1">)</span>
     <span class="org-type">Input</span>    <span class="org-variable-name">Output</span>
    -5.000   -45.000
    -4.000   -35.000
    -3.000   -25.000
    -2.000   -15.000
    -1.000    -5.000
     0.000     5.000
     1.000    15.000
     2.000    25.000
     3.000    35.000
     4.000    45.000
     5.000    55.000
root <span class="org-rainbow-delimiters-depth-1">[</span>71<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</div>

<div id="outline-container-orge06f54d" class="outline-4">
<h4 id="orge06f54d"><span class="section-number-4">1.4.11</span> Playing with STL algorithms</h4>
<div class="outline-text-4" id="text-1-4-11">
<p>
Required headers: &lt;iostram&gt; and &lt;algorithm&gt; (<code>std::for_each</code>)
</p>

<ul class="org-ul">
<li>C Arrays</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-type">double</span> xs <span class="org-rainbow-delimiters-depth-1">[]</span> = <span class="org-rainbow-delimiters-depth-1">{</span>10.0, 5.0, 6.0, 3.0<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-2">[</span>4<span class="org-rainbow-delimiters-depth-2">]</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span> 10.000000, 5.0000000, 6.0000000, 3.0000000 <span class="org-rainbow-delimiters-depth-1">}</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::for_each<span class="org-rainbow-delimiters-depth-1">(</span>xs, xs + 4, <span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-constant">std</span>::cout &lt;&lt; sqrt<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; <span class="org-string">" "</span> &lt;&lt; <span class="org-string">'\n'</span> &lt;&lt; <span class="org-constant">std</span>::flush;<span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-rainbow-delimiters-depth-1">)</span>;
3.16228 
2.23607 
2.44949 
1.73205 
root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> 
</pre>
</div>

<ul class="org-ul">
<li>C++ Vectors</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> vec <span class="org-rainbow-delimiters-depth-1">{</span> 10.0, 3.0, 5.0, 2.0, -6.0<span class="org-rainbow-delimiters-depth-1">}</span> ;
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> xs

root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::for_each<span class="org-rainbow-delimiters-depth-1">(</span>vec.begin<span class="org-rainbow-delimiters-depth-2">()</span>, vec.end<span class="org-rainbow-delimiters-depth-2">()</span>, <span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-constant">std</span>::cout &lt;&lt; sqrt<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;<span class="org-rainbow-delimiters-depth-2">}</span><span class="org-rainbow-delimiters-depth-1">)</span>
3.16228
1.73205
2.23607
1.41421
-nan
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>lambda<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> @0x1a42030

root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::for_each<span class="org-rainbow-delimiters-depth-1">(</span>vec.begin<span class="org-rainbow-delimiters-depth-2">()</span>, vec.end<span class="org-rainbow-delimiters-depth-2">()</span>, <span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-constant">std</span>::cout &lt;&lt; sqrt<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span> &lt;&lt; <span class="org-constant">std</span>::endl;<span class="org-rainbow-delimiters-depth-2">}</span><span class="org-rainbow-delimiters-depth-1">)</span>;
3.16228
1.73205
2.23607
1.41421
-nan

</pre>
</div>
</div>
</div>
