Root-cern-repl.org
*** Show a file 

Paste the following code in the ROOT interpreter.

#+BEGIN_SRC cpp 
  {
  // Headers:  <iostream>, <fstream>,  <stdlib.h>
  void showFile(const char* file){
    std::ifstream fin;
    std::string line;
    fin.open(file);
    if(fin.fail()){
      std::cerr << "Error: file " << file << " cannot be opened.";
      exit(-1);
    }
    while(!fin.eof()){
      std::getline(fin, line);
      std::cout << line << std::endl;
    }
    fin.close();
  }

  }

#+END_SRC

Run: 

#+BEGIN_SRC cpp 
    root [24] showFile("/etc/protocols")
    # /etc/protocols:
    # $Id: protocols,v 1.12 2016/07/08 12:27 ovasik Exp $
    #
    # Internet (IP) protocols
    #
    #	from: @(#)protocols	5.1 (Berkeley) 4/17/89
    #
    # Updated for NetBSD based on RFC 1340, Assigned Numbers (July 1992).
    # Last IANA update included dated 2011-05-03
    #
    # See also http://www.iana.org/assignments/protocol-numbers

    ip	0	IP		# internet protocol, pseudo protocol number
    hopopt	0	HOPOPT		# hop-by-hop options for ipv6
    icmp	1	ICMP		# internet control message protocol
    igmp	2	IGMP		# internet group management protocol
    ggp	3	GGP		# gateway-gateway protocol
    ipv4	4	IPv4		# IPv4 encapsulation
     ... ...  ... ...  ... ...  ... ...  ... ...  ... ... 
#+END_SRC

*** Using boost libraries 

It assumes that the boost libraries are already installed. 

 - Example: Using Boost special math functions
   - [[https://www.boost.org/doc/libs/1_68_0/libs/math/doc/html/math_toolkit/sf_erf/error_function.html][Error Functions - 1.68.0]]

#+BEGIN_SRC cpp 
  root [0] #include <boost/math/special_functions/erf.hpp>
  root [1] boost::math::erf

  root [2] boost::math::erf(0.1)
  (double) 0.11246292
  root [3] 
  root [3] boost::math::erf(2.0)
  (double) 0.99532227
  root [4] boost::math::erf(3.0)
  (double) 0.99997791
 
  root [9] using boost::math::erf;
  root [10] 
  root [10] erf(1.2)
  (double) 0.91031398
  root [11] erf(4.5)
  (double) 1.0000000
  root [12] 

#+END_SRC

