Root-cern-repl.html

<div id="outline-container-orgd46298a" class="outline-4">
<h4 id="orgd46298a"><span class="section-number-4">1.4.12</span> Show a file</h4>
<div class="outline-text-4" id="text-1-4-12">
<p>
Paste the following code in the ROOT interpreter.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Headers:  &lt;iostream&gt;, &lt;fstream&gt;,  &lt;stdlib.h&gt;</span>
<span class="org-type">void</span> <span class="org-variable-name">showFile</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">char</span>* file<span class="org-rainbow-delimiters-depth-2">){</span>
  <span class="org-constant">std</span>::<span class="org-type">ifstream</span> <span class="org-variable-name">fin</span>;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">line</span>;
  fin.open<span class="org-rainbow-delimiters-depth-3">(</span>file<span class="org-rainbow-delimiters-depth-3">)</span>;
  <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-3">(</span>fin.fail<span class="org-rainbow-delimiters-depth-4">()</span><span class="org-rainbow-delimiters-depth-3">){</span>
    <span class="org-constant">std</span>::cerr &lt;&lt; <span class="org-string">"Error: file "</span> &lt;&lt; file &lt;&lt; <span class="org-string">" cannot be opened."</span>;
    exit<span class="org-rainbow-delimiters-depth-4">(</span>-1<span class="org-rainbow-delimiters-depth-4">)</span>;
  <span class="org-rainbow-delimiters-depth-3">}</span>
  <span class="org-keyword">while</span><span class="org-rainbow-delimiters-depth-3">(</span><span class="org-negation-char">!</span>fin.eof<span class="org-rainbow-delimiters-depth-4">()</span><span class="org-rainbow-delimiters-depth-3">){</span>
    <span class="org-constant">std</span>::getline<span class="org-rainbow-delimiters-depth-4">(</span>fin, line<span class="org-rainbow-delimiters-depth-4">)</span>;
    <span class="org-constant">std</span>::cout &lt;&lt; line &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-rainbow-delimiters-depth-3">}</span>
  fin.close<span class="org-rainbow-delimiters-depth-3">()</span>;
<span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Run: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>24<span class="org-rainbow-delimiters-depth-1">]</span> showFile<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/etc/protocols"</span><span class="org-rainbow-delimiters-depth-1">)</span>
# /etc/protocols:
<span class="org-preprocessor"># $Id</span>: protocols,v 1.12 2016/07/08 12:27 ovasik Exp $
#
<span class="org-preprocessor"># Internet</span> <span class="org-rainbow-delimiters-depth-1">(</span>IP<span class="org-rainbow-delimiters-depth-1">)</span> protocols
#
<span class="org-preprocessor">#   from</span>: @<span class="org-rainbow-delimiters-depth-1">(</span>#<span class="org-rainbow-delimiters-depth-1">)</span>protocols 5.1 <span class="org-rainbow-delimiters-depth-1">(</span>Berkeley<span class="org-rainbow-delimiters-depth-1">)</span> 4/17/89
#
<span class="org-preprocessor"># Updated</span> <span class="org-keyword">for</span> NetBSD based on RFC 1340, <span class="org-type">Assigned</span> <span class="org-variable-name">Numbers</span> <span class="org-rainbow-delimiters-depth-1">(</span>July 1992<span class="org-rainbow-delimiters-depth-1">)</span>.
<span class="org-preprocessor"># Last</span> IANA update included dated 2011-05-03
#
<span class="org-preprocessor"># See</span> also http:<span class="org-comment-delimiter">//</span><span class="org-comment">www.iana.org/assignments/protocol-numbers</span>

ip  0   IP      # internet protocol, pseudo protocol <span class="org-type">number</span>
<span class="org-variable-name">hopopt</span>  0   HOPOPT      # hop-by-hop options <span class="org-keyword">for</span> ipv6
icmp    1   ICMP        # internet control message protocol
igmp    2   IGMP        # internet group management protocol
ggp 3   GGP     # gateway-gateway protocol
ipv4    4   IPv4        # IPv4 encapsulation
 ... ...  ... ...  ... ...  ... ...  ... ...  ... ... 
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8da8c0" class="outline-4">
<h4 id="orga8da8c0"><span class="section-number-4">1.4.13</span> Using boost libraries</h4>
<div class="outline-text-4" id="text-1-4-13">
<p>
It assumes that the boost libraries are already installed. 
</p>

<ul class="org-ul">
<li>Example: Using Boost special math functions
<ul class="org-ul">
<li><a href="https://www.boost.org/doc/libs/1_68_0/libs/math/doc/html/math_toolkit/sf_erf/error_function.html">Error Functions - 1.68.0</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>0<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>boost/math/special_functions/erf.hpp<span class="org-rainbow-delimiters-depth-1">&gt;</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">boost</span>::<span class="org-constant">math</span>::erf

root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">boost</span>::<span class="org-constant">math</span>::erf<span class="org-rainbow-delimiters-depth-1">(</span>0.1<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.11246292
root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">boost</span>::<span class="org-constant">math</span>::erf<span class="org-rainbow-delimiters-depth-1">(</span>2.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.99532227
root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">boost</span>::<span class="org-constant">math</span>::erf<span class="org-rainbow-delimiters-depth-1">(</span>3.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.99997791

root <span class="org-rainbow-delimiters-depth-1">[</span>9<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">using</span> <span class="org-constant">boost</span>::<span class="org-constant">math</span>::erf;
root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> erf<span class="org-rainbow-delimiters-depth-1">(</span>1.2<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 0.91031398
root <span class="org-rainbow-delimiters-depth-1">[</span>11<span class="org-rainbow-delimiters-depth-1">]</span> erf<span class="org-rainbow-delimiters-depth-1">(</span>4.5<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 1.0000000
root <span class="org-rainbow-delimiters-depth-1">[</span>12<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</div>
