Root-cern-repl.org
*** Playing with GNU Scientific library shared library 

Note: the command #pragma cling load("/lib64/libgslcblas.so.0") is
used to load the symbols from the shared library libgslcblas.so.

#+BEGIN_SRC cpp 
  root [1] #pragma cling load("/lib64/libgslcblas.so.0")
  root [2] 
  root [2] #pragma cling load("/lib64/libgsl.so")
  root [3] 
  root [3] #include <gsl/gsl_errno.h>
  root [4] #include <gsl/gsl_sf_bessel.h>
  root [5] 
  root [5] gsl_sf_bessel_J0(4.0)
  (double) -0.39714981
  root [6] gsl_sf_bessel_J0(5.0)
  (double) -0.17759677
  root [7] 

  {
    double x = 5.0;
    double expected = -0.17759677131433830434739701;
  
    double y = gsl_sf_bessel_J0 (x);

    printf ("J0(5.0) = %.18f\n", y);
    printf ("exact   = %.18f\n", expected);
  }
  // Output: 
  J0(5.0) = -0.177596771314338264
  exact   = -0.177596771314338292
  root [14] 


#+END_SRC

Complete script using (#prgram cling load) to load the shared
libraries command:

 - [[https://root-forum.cern.ch/t/how-to-call-external-libraries/10845][How to call external libraries - ROOT - ROOT Forum]]

#+BEGIN_SRC cpp
  #include <gsl/gsl_errno.h>
  #include <gsl/gsl_sf_bessel.h>

  #pragma cling load("/lib64/libgslcblas.so.0")
  #pragma cling load("/lib64/libgsl.so")

  gsl_sf_bessel_J0(4.0);
  gsl_sf_bessel_J0(5.0);
  double x = 5.0;
  double expected = -0.17759677131433830434739701;

  double y = gsl_sf_bessel_J0 (x);

  printf ("J0(5.0) = %.18f\n", y);
  printf ("exact   = %.18f\n", expected);

#+END_SRC

Complete script using gSystem->Load to add load libraries: 

#+BEGIN_SRC cpp 
  #include <gsl/gsl_errno.h>
  #include <gsl/gsl_sf_bessel.h>

  gSystem->Load("/lib64/libgslcblas.so.0");
  gSystem->Load("/lib64/libgsl.so");

  gsl_sf_bessel_J0(4.0);
  gsl_sf_bessel_J0(5.0);
  double x = 5.0;
  double expected = -0.17759677131433830434739701;

  double y = gsl_sf_bessel_J0 (x);

  printf ("J0(5.0) = %.18f\n", y);
  printf ("exact   = %.18f\n", expected);
#+END_SRC

Complete script using gSystem->AddLinkedLibs to load shared libraries: 

#+BEGIN_SRC cpp 
  #include <gsl/gsl_errno.h>
  #include <gsl/gsl_sf_bessel.h>

  gSystem->AddLinkedLibs("-lgsl -lgslcblas");
  // gSystem->AddLinkedLibs("-lgsl");
  // gSystem->AddLinkedLibs("-lgslcblas");

  gsl_sf_bessel_J0(4.0);
  gsl_sf_bessel_J0(5.0);
  double x = 5.0;
  double expected = -0.17759677131433830434739701;

  double y = gsl_sf_bessel_J0 (x);

  printf ("J0(5.0) = %.18f\n", y);
  printf ("exact   = %.18f\n", expected);

#+END_SRC

*** Testing Unix System-Calls and APIs 
