Root-cern-repl.html

<div id="outline-container-org7382e2b" class="outline-4">
<h4 id="org7382e2b"><span class="section-number-4">1.4.14</span> Playing with GNU Scientific library shared library</h4>
<div class="outline-text-4" id="text-1-4-14">
<p>
Note: the command #pragma cling load("/lib64/libgslcblas.so.0") is
used to load the symbols from the shared library libgslcblas.so.
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>1<span class="org-rainbow-delimiters-depth-1">]</span> #pragma cling load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libgslcblas.so.0"</span><span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>2<span class="org-rainbow-delimiters-depth-1">]</span> #pragma cling load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libgsl.so"</span><span class="org-rainbow-delimiters-depth-1">)</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>3<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>gsl/gsl_errno.h<span class="org-rainbow-delimiters-depth-1">&gt;</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>4<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>gsl/gsl_sf_bessel.h<span class="org-rainbow-delimiters-depth-1">&gt;</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>5<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>5<span class="org-rainbow-delimiters-depth-1">]</span> gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> -0.39714981
root <span class="org-rainbow-delimiters-depth-1">[</span>6<span class="org-rainbow-delimiters-depth-1">]</span> gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> -0.17759677
root <span class="org-rainbow-delimiters-depth-1">[</span>7<span class="org-rainbow-delimiters-depth-1">]</span> 

<span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-type">double</span> <span class="org-variable-name">x</span> = 5.0;
  <span class="org-type">double</span> <span class="org-variable-name">expected</span> = -0.17759677131433830434739701;

  <span class="org-type">double</span> <span class="org-variable-name">y</span> = gsl_sf_bessel_J0 <span class="org-rainbow-delimiters-depth-2">(</span>x<span class="org-rainbow-delimiters-depth-2">)</span>;

  printf <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"J0(5.0) = %.18f\n"</span>, y<span class="org-rainbow-delimiters-depth-2">)</span>;
  printf <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"exact   = %.18f\n"</span>, expected<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Output: </span>
J0<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span> = -0.177596771314338264
exact   = -0.177596771314338292
root <span class="org-rainbow-delimiters-depth-1">[</span>14<span class="org-rainbow-delimiters-depth-1">]</span> 


</pre>
</div>

<p>
Complete script using (#prgram cling load) to load the shared
libraries command:
</p>

<ul class="org-ul">
<li><a href="https://root-forum.cern.ch/t/how-to-call-external-libraries/10845">How to call external libraries - ROOT - ROOT Forum</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_errno.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_sf_bessel.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-preprocessor">#pragma</span> cling load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libgslcblas.so.0"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-preprocessor">#pragma</span> cling load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libgsl.so"</span><span class="org-rainbow-delimiters-depth-1">)</span>

gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span>;
gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">double</span> <span class="org-variable-name">x</span> = 5.0;
<span class="org-type">double</span> <span class="org-variable-name">expected</span> = -0.17759677131433830434739701;

<span class="org-type">double</span> <span class="org-variable-name">y</span> = gsl_sf_bessel_J0 <span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span>;

printf <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"J0(5.0) = %.18f\n"</span>, y<span class="org-rainbow-delimiters-depth-1">)</span>;
printf <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"exact   = %.18f\n"</span>, expected<span class="org-rainbow-delimiters-depth-1">)</span>;

</pre>
</div>

<p>
Complete script using gSystem-&gt;Load to add load libraries: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_errno.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_sf_bessel.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

gSystem-&gt;Load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libgslcblas.so.0"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
gSystem-&gt;Load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libgsl.so"</span><span class="org-rainbow-delimiters-depth-1">)</span>;

gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span>;
gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">double</span> <span class="org-variable-name">x</span> = 5.0;
<span class="org-type">double</span> <span class="org-variable-name">expected</span> = -0.17759677131433830434739701;

<span class="org-type">double</span> <span class="org-variable-name">y</span> = gsl_sf_bessel_J0 <span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span>;

printf <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"J0(5.0) = %.18f\n"</span>, y<span class="org-rainbow-delimiters-depth-1">)</span>;
printf <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"exact   = %.18f\n"</span>, expected<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Complete script using gSystem-&gt;AddLinkedLibs to load shared libraries: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_errno.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_sf_bessel.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

gSystem-&gt;AddLinkedLibs<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"-lgsl -lgslcblas"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">gSystem-&gt;AddLinkedLibs("-lgsl");</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">gSystem-&gt;AddLinkedLibs("-lgslcblas");</span>

gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span>;
gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>5.0<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-type">double</span> <span class="org-variable-name">x</span> = 5.0;
<span class="org-type">double</span> <span class="org-variable-name">expected</span> = -0.17759677131433830434739701;

<span class="org-type">double</span> <span class="org-variable-name">y</span> = gsl_sf_bessel_J0 <span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span>;

printf <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"J0(5.0) = %.18f\n"</span>, y<span class="org-rainbow-delimiters-depth-1">)</span>;
printf <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"exact   = %.18f\n"</span>, expected<span class="org-rainbow-delimiters-depth-1">)</span>;

</pre>
</div>
</div>
</div>

<div id="outline-container-org142ce54" class="outline-4">
<h4 id="org142ce54"><span class="section-number-4">1.4.15</span> Testing Unix System-Calls and APIs</h4>
<div class="outline-text-4" id="text-1-4-15">
</div>
<ol class="org-ol">
