Root-cern-repl.org
**** Get current directory - getcwd()

 - [[http://pubs.opengroup.org/onlinepubs/009695399/functions/getcwd.html][Unix Open Group - getcwd]]

Get current working directory of current process: 

#+BEGIN_SRC cpp 
  #include <unistd.h>

  root [10] getcwd(nullptr, 0)
  (char *) "/home/archbox/shared/reflection-root"
  root [11] 

  root [7] std::string current_dir = getcwd(nullptr, 0)
  (std::string &) "/home/archbox/shared/reflection-root"

  root [8] current_dir
  (std::string &) "/home/archbox/shared/reflection-root"

  root [9] std::cout << "Current directory = " << current_dir << std::endl;
  Current directory = /home/archbox/shared/reflection-root

#+END_SRC

Set current working directory of current process: 

 - [[https://linux.die.net/man/2/chdir][chdir(2): change working directory - Linux man page]]

#+BEGIN_SRC cpp 
oot [15] 
root [15] getcwd(nullptr, 0)
(char *) "/etc"
root [16] 
root [16] chdir("/usr/include")
(int) 0
root [17] getcwd(nullptr, 0)
(char *) "/usr/include"
root [18] chdir("/usr/includeError")
(int) -1
root [19] getcwd(nullptr, 0)
(char *) "/usr/include"
root [20] 

#+END_SRC
**** Create a directory - mkdir 

Documentation: 
 - [[http://pubs.opengroup.org/onlinepubs/009695399/functions/mkdir.html][Open Group Base Specification Issue 6 - mkdir]]
 - [[https://linux.die.net/man/3/mkdir][mkdir(3): make directory - Linux man page]]

#+BEGIN_SRC cpp 
  root [9] #include <stdlib.h>
  root [10] #include <limits.h>  
  root [11] #include <unistd.h>
  root [12] #include <sys/stat.h> 
  root [13] 
  root [14] mkdir("/home/archbox/Desktop/mydir", 0777)
  (int) 0
  root [15] 
  root [15] mkdir("/home/archbox/Desktop/mydir", 0777)
  (int) -1
  root [16] 
#+END_SRC

