Root-cern-repl.html
<li><a id="org93aaa3e"></a>Get current directory - getcwd()<br />
<div class="outline-text-5" id="text-1-4-15-1">
<ul class="org-ul">
<li><a href="http://pubs.opengroup.org/onlinepubs/009695399/functions/getcwd.html">Unix Open Group - getcwd</a></li>
</ul>

<p>
Get current working directory of current process: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">unistd.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> getcwd<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">nullptr</span>, 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/home/archbox/shared/reflection-root"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>11<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>7<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::string current_dir = getcwd<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">nullptr</span>, 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/home/archbox/shared/reflection-root"</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>8<span class="org-rainbow-delimiters-depth-1">]</span> current_dir
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> &amp;<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/home/archbox/shared/reflection-root"</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>9<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Current directory = "</span> &lt;&lt; current_dir &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-type">Current</span> <span class="org-variable-name">directory</span> = /home/archbox/shared/reflection-root

</pre>
</div>

<p>
Set current working directory of current process: 
</p>

<ul class="org-ul">
<li><a href="https://linux.die.net/man/2/chdir">chdir(2): change working directory - Linux man page</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">oot <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> getcwd<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">nullptr</span>, 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/etc"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>16<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>16<span class="org-rainbow-delimiters-depth-1">]</span> chdir<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/usr/include"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0
root <span class="org-rainbow-delimiters-depth-1">[</span>17<span class="org-rainbow-delimiters-depth-1">]</span> getcwd<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">nullptr</span>, 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/usr/include"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>18<span class="org-rainbow-delimiters-depth-1">]</span> chdir<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/usr/includeError"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> -1
root <span class="org-rainbow-delimiters-depth-1">[</span>19<span class="org-rainbow-delimiters-depth-1">]</span> getcwd<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">nullptr</span>, 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"/usr/include"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>20<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</li>
<li><a id="org981c629"></a>Create a directory - mkdir<br />
<div class="outline-text-5" id="text-1-4-15-2">
<p>
Documentation: 
</p>
<ul class="org-ul">
<li><a href="http://pubs.opengroup.org/onlinepubs/009695399/functions/mkdir.html">Open Group Base Specification Issue 6 - mkdir</a></li>
<li><a href="https://linux.die.net/man/3/mkdir">mkdir(3): make directory - Linux man page</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>9<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>stdlib.h<span class="org-rainbow-delimiters-depth-1">&gt;</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>10<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>limits.h<span class="org-rainbow-delimiters-depth-1">&gt;</span>  
root <span class="org-rainbow-delimiters-depth-1">[</span>11<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>unistd.h<span class="org-rainbow-delimiters-depth-1">&gt;</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>12<span class="org-rainbow-delimiters-depth-1">]</span> #<span class="org-type">include</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>sys/stat.h<span class="org-rainbow-delimiters-depth-1">&gt;</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>13<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>14<span class="org-rainbow-delimiters-depth-1">]</span> mkdir<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/home/archbox/Desktop/mydir"</span>, 0777<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> mkdir<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/home/archbox/Desktop/mydir"</span>, 0777<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> -1
root <span class="org-rainbow-delimiters-depth-1">[</span>16<span class="org-rainbow-delimiters-depth-1">]</span> 
</pre>
</div>
</div>
</li>
