Root-cern-repl.org
**** List directory - opendir 

#+BEGIN_SRC cpp 
  // #include <string>
  #include <sys/types.h>
  #include <dirent.h>  // Get function opendir
  #include <errno.h>

  void listDirectory(const std::string& path){
      DIR *dir;
      struct dirent *dp;
      dir = opendir(path.c_str()) ;
      // To determine the cause of error - It is necessary to check the error code.
      if (dir == NULL)
       throw std::runtime_error("Error: Cannot read directory");
      while ((dp = readdir(dir)) != NULL) {
      std::cout << dp->d_name << std::endl ;
      };
      closedir(dir);
  }
#+END_SRC

Running in root REPL: 

#+BEGIN_SRC cpp 
  root [37] listDirectory("/")
  etc
  tmp
  sbin
  sys
  opt
  media
  .
  boot
  .local
  .autorelabel
  home
  var
  dev
  .. ... ... 

  root [39] listDirectory("/boot/grub")
  .
  splash.xpm.gz
  ..
  root [40] 
  root [40] 

  root [40] listDirectory("/boot/grub/dsafa")
  Error in <TRint::HandleTermInput()>: std::runtime_error caught: Error: Cannot read directory
  root [41] 
  root [41] 
#+END_SRC

**** Read process output with popen 

#+BEGIN_SRC cpp 
  // Copy and paste this code in the ROOT REPL
  {
          FILE* fp = popen("ls -l /", "r");
          char ch;
          std::stringstream ss;
          if(!fp)
                  std::cerr << "Error: could not open process output." << std::endl;
          while((ch = fgetc(fp)) != EOF){
                  ss << ch;
          }
          pclose(fp);
          std::cout << "Output = " << '\n' << ss.str() << std::flush;	
  }

  // Ouptut: 

#+END_SRC

Output: 

#+BEGIN_SRC text 
  Output = 
  total 64
  lrwxrwxrwx.   1 root root     7 Feb 10  2017 bin -> usr/bin
  dr-xr-xr-x.   7 root root  4096 Jul 15 15:58 boot
  drwxr-xr-x   23 root root  4220 Sep  8 17:47 dev
  drwxr-xr-x. 169 root root 12288 Sep 10 03:27 etc
  drwxr-xr-x.   5 root root  4096 Mar  2  2018 home
  lrwxrwxrwx.   1 root root     7 Feb 10  2017 lib -> usr/lib
  lrwxrwxrwx.   1 root root     9 Feb 10  2017 lib64 -> usr/lib64
  drwx------.   2 root root 16384 Sep 17  2017 lost+found
  drwxr-xr-x.   2 root root  4096 Feb 10  2017 media
  drwxr-xr-x.   2 root root  4096 Feb 10  2017 mnt
   ... .... ... .... ... .... ... .... ... .... 
#+END_SRC

This unnamed script can be encapsulate into a function: 

#+BEGIN_SRC cpp
  std::string getProcessOutput(std::string command){
          FILE* fp = popen(command.c_str(), "r");
          char ch;
          std::stringstream ss;
          if(!fp)
                  std::cerr << "Error: could not open process output." << std::endl;
          while((ch = fgetc(fp)) != EOF){
                  ss << ch;
          }
          pclose(fp);
          return ss.str();
  }

  root [14] getProcessOutput("date")
  (std::string) "Mon Sep 10 16:46:06 -03 2018
  "
  root [15] getProcessOutput("uname -a")
  (std::string) "Linux localhost.localdomain 4.16.11-100.fc26.x86_64 #1 SMP Tue May 22 20:02:12 UTC 2018 x86_64 x86_64 x86_64 GNU/Linux
  "
  root [16] 

#+END_SRC

*** Run a script with shared library 
** C++ Script Examples 
