Root-cern-repl.html

<li><a id="org695251c"></a>List directory - opendir<br />
<div class="outline-text-5" id="text-1-4-15-3">
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">#include &lt;string&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">sys/types.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">dirent.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Get function opendir</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">errno.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-type">void</span> <span class="org-function-name">listDirectory</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">path</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-type">DIR</span> *<span class="org-variable-name">dir</span>;
    <span class="org-keyword">struct</span> <span class="org-type">dirent</span> *<span class="org-variable-name">dp</span>;
    dir = opendir<span class="org-rainbow-delimiters-depth-2">(</span>path.c_str<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span> ;
    <span class="org-comment-delimiter">// </span><span class="org-comment">To determine the cause of error - It is necessary to check the error code.</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">(</span>dir == <span class="org-constant">NULL</span><span class="org-rainbow-delimiters-depth-2">)</span>
     <span class="org-keyword">throw</span> <span class="org-constant">std</span>::runtime_error<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Error: Cannot read directory"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>dp = readdir<span class="org-rainbow-delimiters-depth-4">(</span>dir<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> != <span class="org-constant">NULL</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-constant">std</span>::cout &lt;&lt; dp-&gt;d_name &lt;&lt; <span class="org-constant">std</span>::endl ;
    <span class="org-rainbow-delimiters-depth-2">}</span>;
    closedir<span class="org-rainbow-delimiters-depth-2">(</span>dir<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Running in root REPL: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">root <span class="org-rainbow-delimiters-depth-1">[</span>37<span class="org-rainbow-delimiters-depth-1">]</span> listDirectory<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/"</span><span class="org-rainbow-delimiters-depth-1">)</span>
etc
tmp
sbin
sys
<span class="org-type">opt</span>
<span class="org-variable-name">media</span>
.
boot
.local
.autorelabel
home
var
dev
.. ... ... 

root <span class="org-rainbow-delimiters-depth-1">[</span>39<span class="org-rainbow-delimiters-depth-1">]</span> listDirectory<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/boot/grub"</span><span class="org-rainbow-delimiters-depth-1">)</span>
.
splash.xpm.gz
..
root <span class="org-rainbow-delimiters-depth-1">[</span>40<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>40<span class="org-rainbow-delimiters-depth-1">]</span> 

root <span class="org-rainbow-delimiters-depth-1">[</span>40<span class="org-rainbow-delimiters-depth-1">]</span> listDirectory<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/boot/grub/dsafa"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-type">Error</span> <span class="org-type">in</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-constant">TRint</span>::HandleTermInput<span class="org-rainbow-delimiters-depth-2">()</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>: <span class="org-constant">std</span>::runtime_error caught: Error: Cannot read directory
root <span class="org-rainbow-delimiters-depth-1">[</span>41<span class="org-rainbow-delimiters-depth-1">]</span> 
root <span class="org-rainbow-delimiters-depth-1">[</span>41<span class="org-rainbow-delimiters-depth-1">]</span> 
</pre>
</div>
</div>
</li>

<li><a id="orgc3b233f"></a>Read process output with popen<br />
<div class="outline-text-5" id="text-1-4-15-4">
<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Copy and paste this code in the ROOT REPL</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-type">FILE</span>* <span class="org-variable-name">fp</span> = popen<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"ls -l /"</span>, <span class="org-string">"r"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-type">char</span> <span class="org-variable-name">ch</span>;
        <span class="org-constant">std</span>::<span class="org-type">stringstream</span> <span class="org-variable-name">ss</span>;
        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-negation-char">!</span>fp<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cerr &lt;&lt; <span class="org-string">"Error: could not open process output."</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        <span class="org-keyword">while</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>ch = fgetc<span class="org-rainbow-delimiters-depth-4">(</span>fp<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> != EOF<span class="org-rainbow-delimiters-depth-2">){</span>
                ss &lt;&lt; ch;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        pclose<span class="org-rainbow-delimiters-depth-2">(</span>fp<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Output = "</span> &lt;&lt; <span class="org-string">'\n'</span> &lt;&lt; ss.str<span class="org-rainbow-delimiters-depth-2">()</span> &lt;&lt; <span class="org-constant">std</span>::flush; 
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Ouptut: </span>

</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-text">Output = 
total 64
lrwxrwxrwx.   1 root root     7 Feb 10  2017 bin -&gt; usr/bin
dr-xr-xr-x.   7 root root  4096 Jul 15 15:58 boot
drwxr-xr-x   23 root root  4220 Sep  8 17:47 dev
drwxr-xr-x. 169 root root 12288 Sep 10 03:27 etc
drwxr-xr-x.   5 root root  4096 Mar  2  2018 home
lrwxrwxrwx.   1 root root     7 Feb 10  2017 lib -&gt; usr/lib
lrwxrwxrwx.   1 root root     9 Feb 10  2017 lib64 -&gt; usr/lib64
drwx------.   2 root root 16384 Sep 17  2017 lost+found
drwxr-xr-x.   2 root root  4096 Feb 10  2017 media
drwxr-xr-x.   2 root root  4096 Feb 10  2017 mnt
 ... .... ... .... ... .... ... .... ... .... 
</pre>
</div>

<p>
This unnamed script can be encapsulate into a function: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::string getProcessOutput<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">command</span><span class="org-rainbow-delimiters-depth-1">){</span>
        <span class="org-type">FILE</span>* <span class="org-variable-name">fp</span> = popen<span class="org-rainbow-delimiters-depth-2">(</span>command.c_str<span class="org-rainbow-delimiters-depth-3">()</span>, <span class="org-string">"r"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-type">char</span> <span class="org-variable-name">ch</span>;
        <span class="org-constant">std</span>::<span class="org-type">stringstream</span> <span class="org-variable-name">ss</span>;
        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-negation-char">!</span>fp<span class="org-rainbow-delimiters-depth-2">)</span>
                <span class="org-constant">std</span>::cerr &lt;&lt; <span class="org-string">"Error: could not open process output."</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        <span class="org-keyword">while</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>ch = fgetc<span class="org-rainbow-delimiters-depth-4">(</span>fp<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> != EOF<span class="org-rainbow-delimiters-depth-2">){</span>
                ss &lt;&lt; ch;
        <span class="org-rainbow-delimiters-depth-2">}</span>
        pclose<span class="org-rainbow-delimiters-depth-2">(</span>fp<span class="org-rainbow-delimiters-depth-2">)</span>;
        <span class="org-keyword">return</span> ss.str<span class="org-rainbow-delimiters-depth-2">()</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

root <span class="org-rainbow-delimiters-depth-1">[</span>14<span class="org-rainbow-delimiters-depth-1">]</span> getProcessOutput<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"date"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-warning">"</span><span class="org-string">Mon Sep 10 16:46:06 -03 2018</span>
<span class="org-string">"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>15<span class="org-rainbow-delimiters-depth-1">]</span> getProcessOutput<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"uname -a"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-constant">std</span>::string<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-warning">"</span><span class="org-string">Linux localhost.localdomain 4.16.11-100.fc26.x86_64 #1 SMP Tue May 22 20:02:12 UTC 2018 x86_64 x86_64 x86_64 GNU/Linux</span>
<span class="org-string">"</span>
root <span class="org-rainbow-delimiters-depth-1">[</span>16<span class="org-rainbow-delimiters-depth-1">]</span> 

</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org02aaced" class="outline-4">
<h4 id="org02aaced"><span class="section-number-4">1.4.16</span> Run a script with shared library</h4>
</div>
</div>
<div id="outline-container-org3b534ba" class="outline-3">
<h3 id="org3b534ba"><span class="section-number-3">1.5</span> C++ Script Examples</h3>
<div class="outline-text-3" id="text-1-5">
</div>
