Root-cern-repl.org
*** Example: Run a Ublas - Boost Library Linear Algebra C++ script 

File: ublas.C 

#+BEGIN_SRC cpp 
  #include <iostream>
  #include <string>

  // Headers for vectors 
  #include <boost/numeric/ublas/vector.hpp>
  #include <boost/numeric/ublas/io.hpp>

  // Headers for Matrix 
  #include <boost/numeric/ublas/matrix.hpp>

  namespace ub = boost::numeric::ublas;

  template<class T>
  void printVal(const std::string &name, const T &value){
      std::cout << name << " = " << value << std::endl;
  }

  void printSection(const std::string &descr){
      std::cout << descr << std::endl;
      for(int i = 0; i < descr.size(); i++){
          std::cout << '-';
      }
      std::cout << std::endl;
  }

  void vecOperation1(){
      ub::vector<double> vec1(5, 1.0);
      printVal("vec1", vec1);
      vec1[1] = 2.4;
      vec1[2] = 3.5;
      vec1[3] = -5.0;
      printVal("vec1", vec1); 
      printVal("sum(vec1)", sum(vec1));
      printVal("norm_1(vec1)", norm_1(vec1));
      printVal("norm_2(vec1)", norm_2(vec1)); 
      printVal("norm_inf(vec1)", norm_inf(vec1));
      printVal("index_norm_inf(vec1)", index_norm_inf(vec1)); 
  }

  void vecOperation2(){
      ub::vector<double> vec1(3, 2.2) ; vec1[2] = -5.1;
      ub::vector<double> vec2(3, -1.2); vec2[2] = 1.1;

      double factor = 2.5;

      printVal("vec1", vec1);
      printVal("vec1.size()", vec1.size());

      printVal("vec2", vec2);
      printVal("vec2.size()", vec2.size());

      printVal("inner_prod(vec1, vec2)", inner_prod(vec1, vec2));

      printVal("vec1 + vec2", vec1 + vec2);
      printVal("vec1 - vec2", vec1 - vec2);
      printVal("vec1 * factor", vec1 * factor);
      printVal("vec1 / factor", vec1 / factor);

  }

  void matrixOperation1(){
      ub::matrix<double> matrix1(3, 3, 2.5);
      matrix1(0, 0) = matrix1(2, 2) = 1.0;
      matrix1(0, 2) = -3.5; matrix1(2, 0) = 5.9;

      printVal("matrix1     ", matrix1);
      printVal("Num of rows ", matrix1.size1());
      printVal("Num of cols ", matrix1.size2());
      printVal("Transpose   ", trans(matrix1));
      printVal("Real part   ", real(matrix1));

      matrix1.resize(4, 4);
      printVal("Matrix resized = matrix1.resize(4, 4)", matrix1);

      printVal("identity_matrix<double>(3)", ub::identity_matrix<double>(3));
      printVal("zero_matrix<double>(3)", ub::zero_matrix<double>(3));

  }

  // SCRIPT Entry-point - must have the same name as the file.
  void ublas(){
      printSection("Running vecOperation1");
      vecOperation1();
      std::cout << std::endl; 

      printSection("Running vecOperation2");
      vecOperation2();
      std::cout << std::endl;

      printSection("Running matrixOperation1");
      matrixOperation1();
  }

#+END_SRC

Running in batch mode: 

#+BEGIN_SRC sh 
  $ $HOME/opt/root/bin/root -l -q ublas.C
  ERROR in cling::CIFactory::createCI(): cannot extract standard library include paths!
  Invoking:
    LC_ALL=C ccache  -O3 -DNDEBUG -xc++ -E -v /dev/null 2>&1 >/dev/null | awk '/^#include </,/^End of search/{if (!/^#include </ && !/^End of search/){ print }}' | GREP_OPTIONS= grep -E "(c|g)\+\+"
  Results was:
  With exit code 256

  Processing ublas.C...
  Running vecOperation1
  ---------------------
  vec1 = [5](1,1,1,1,1)
  vec1 = [5](1,2.4,3.5,-5,1)
  sum(vec1) = 2.9
  norm_1(vec1) = 12.9
  norm_2(vec1) = 6.70895
  norm_inf(vec1) = 5
  index_norm_inf(vec1) = 3

  Running vecOperation2
  ---------------------
  vec1 = [3](2.2,2.2,-5.1)
  vec1.size() = 3
  vec2 = [3](-1.2,-1.2,1.1)
  vec2.size() = 3
  inner_prod(vec1, vec2) = -10.89
  vec1 + vec2 = [3](1,1,-4)
  vec1 - vec2 = [3](3.4,3.4,-6.2)
  vec1 * factor = [3](5.5,5.5,-12.75)
  vec1 / factor = [3](0.88,0.88,-2.04)

  Running matrixOperation1
  ------------------------
  matrix1      = [3,3]((1,2.5,-3.5),(2.5,2.5,2.5),(5.9,2.5,1))
  Num of rows  = 3
  Num of cols  = 3
  Transpose    = [3,3]((1,2.5,5.9),(2.5,2.5,2.5),(-3.5,2.5,1))
  Real part    = [3,3]((1,2.5,-3.5),(2.5,2.5,2.5),(5.9,2.5,1))
  Matrix resized = matrix1.resize(4, 4) = [4,4]((1,2.5,-3.5,2.93415e+59),(2.5,2.5,2.5,1.10542e+161),(5.9,2.5,1,9.83212e-72),(1.41746e+190,5.16752e+25,6.32283e+233,6.94321e-307))
  identity_matrix<double>(3) = [3,3]((1,0,0),(0,1,0),(0,0,1))
  zero_matrix<double>(3) = [3,3]((0,0,0),(0,0,0),(0,0,0))
#+END_SRC
