Root-cern-repl.html
<div id="outline-container-orgf3e0488" class="outline-4">
<h4 id="orgf3e0488"><span class="section-number-4">1.5.1</span> Example: Run a Ublas - Boost Library Linear Algebra C++ script</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
File: ublas.C 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">string</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Headers for vectors </span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">boost/numeric/ublas/vector.hpp</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">boost/numeric/ublas/io.hpp</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Headers for Matrix </span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">boost/numeric/ublas/matrix.hpp</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-keyword">namespace</span> <span class="org-constant">ub</span> = <span class="org-constant">boost</span>::<span class="org-constant">numeric</span>::ublas;

<span class="org-keyword">template</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">class</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">printVal</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span> &amp;<span class="org-variable-name">name</span>, <span class="org-keyword">const</span> <span class="org-type">T</span> &amp;<span class="org-variable-name">value</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; name &lt;&lt; <span class="org-string">" = "</span> &lt;&lt; value &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">void</span> <span class="org-function-name">printSection</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span> &amp;<span class="org-variable-name">descr</span><span class="org-rainbow-delimiters-depth-1">){</span>
    <span class="org-constant">std</span>::cout &lt;&lt; descr &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; descr.size<span class="org-rainbow-delimiters-depth-3">()</span>; i++<span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">'-'</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">void</span> <span class="org-function-name">vecOperation1</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    <span class="org-constant">ub</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">vec1</span><span class="org-rainbow-delimiters-depth-2">(</span>5, 1.0<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1"</span>, vec1<span class="org-rainbow-delimiters-depth-2">)</span>;
    vec1<span class="org-rainbow-delimiters-depth-2">[</span>1<span class="org-rainbow-delimiters-depth-2">]</span> = 2.4;
    vec1<span class="org-rainbow-delimiters-depth-2">[</span>2<span class="org-rainbow-delimiters-depth-2">]</span> = 3.5;
    vec1<span class="org-rainbow-delimiters-depth-2">[</span>3<span class="org-rainbow-delimiters-depth-2">]</span> = -5.0;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1"</span>, vec1<span class="org-rainbow-delimiters-depth-2">)</span>; 
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"sum(vec1)"</span>, sum<span class="org-rainbow-delimiters-depth-3">(</span>vec1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"norm_1(vec1)"</span>, norm_1<span class="org-rainbow-delimiters-depth-3">(</span>vec1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"norm_2(vec1)"</span>, norm_2<span class="org-rainbow-delimiters-depth-3">(</span>vec1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>; 
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"norm_inf(vec1)"</span>, norm_inf<span class="org-rainbow-delimiters-depth-3">(</span>vec1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"index_norm_inf(vec1)"</span>, index_norm_inf<span class="org-rainbow-delimiters-depth-3">(</span>vec1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>; 
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">void</span> <span class="org-function-name">vecOperation2</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    <span class="org-constant">ub</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">vec1</span><span class="org-rainbow-delimiters-depth-2">(</span>3, 2.2<span class="org-rainbow-delimiters-depth-2">)</span> ; vec1<span class="org-rainbow-delimiters-depth-2">[</span>2<span class="org-rainbow-delimiters-depth-2">]</span> = -5.1;
    <span class="org-constant">ub</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">vec2</span><span class="org-rainbow-delimiters-depth-2">(</span>3, -1.2<span class="org-rainbow-delimiters-depth-2">)</span>; vec2<span class="org-rainbow-delimiters-depth-2">[</span>2<span class="org-rainbow-delimiters-depth-2">]</span> = 1.1;

    <span class="org-type">double</span> <span class="org-variable-name">factor</span> = 2.5;

    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1"</span>, vec1<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1.size()"</span>, vec1.size<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;

    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec2"</span>, vec2<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec2.size()"</span>, vec2.size<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;

    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"inner_prod(vec1, vec2)"</span>, inner_prod<span class="org-rainbow-delimiters-depth-3">(</span>vec1, vec2<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;

    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1 + vec2"</span>, vec1 + vec2<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1 - vec2"</span>, vec1 - vec2<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1 * factor"</span>, vec1 * factor<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"vec1 / factor"</span>, vec1 / factor<span class="org-rainbow-delimiters-depth-2">)</span>;

<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-type">void</span> <span class="org-function-name">matrixOperation1</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    <span class="org-constant">ub</span>::<span class="org-type">matrix</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">matrix1</span><span class="org-rainbow-delimiters-depth-2">(</span>3, 3, 2.5<span class="org-rainbow-delimiters-depth-2">)</span>;
    matrix1<span class="org-rainbow-delimiters-depth-2">(</span>0, 0<span class="org-rainbow-delimiters-depth-2">)</span> = matrix1<span class="org-rainbow-delimiters-depth-2">(</span>2, 2<span class="org-rainbow-delimiters-depth-2">)</span> = 1.0;
    matrix1<span class="org-rainbow-delimiters-depth-2">(</span>0, 2<span class="org-rainbow-delimiters-depth-2">)</span> = -3.5; matrix1<span class="org-rainbow-delimiters-depth-2">(</span>2, 0<span class="org-rainbow-delimiters-depth-2">)</span> = 5.9;

    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"matrix1     "</span>, matrix1<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Num of rows "</span>, matrix1.size1<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Num of cols "</span>, matrix1.size2<span class="org-rainbow-delimiters-depth-3">()</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Transpose   "</span>, trans<span class="org-rainbow-delimiters-depth-3">(</span>matrix1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Real part   "</span>, real<span class="org-rainbow-delimiters-depth-3">(</span>matrix1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;

    matrix1.resize<span class="org-rainbow-delimiters-depth-2">(</span>4, 4<span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Matrix resized = matrix1.resize(4, 4)"</span>, matrix1<span class="org-rainbow-delimiters-depth-2">)</span>;

    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"identity_matrix&lt;double&gt;(3)"</span>, <span class="org-constant">ub</span>::identity_matrix<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>3<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    printVal<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"zero_matrix&lt;double&gt;(3)"</span>, <span class="org-constant">ub</span>::zero_matrix<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>3<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;

<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">SCRIPT Entry-point - must have the same name as the file.</span>
<span class="org-type">void</span> <span class="org-function-name">ublas</span><span class="org-rainbow-delimiters-depth-1">(){</span>
    printSection<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Running vecOperation1"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    vecOperation1<span class="org-rainbow-delimiters-depth-2">()</span>;
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl; 

    printSection<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Running vecOperation2"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    vecOperation2<span class="org-rainbow-delimiters-depth-2">()</span>;
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;

    printSection<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"Running matrixOperation1"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    matrixOperation1<span class="org-rainbow-delimiters-depth-2">()</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Running in batch mode: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ $<span class="org-variable-name">HOME</span>/opt/root/bin/root -l -q ublas.C
ERROR<span class="org-keyword"> in</span> cling::CIFactory::createCI(): cannot extract standard library include paths!
<span class="org-function-name">Invoking</span>:
  <span class="org-variable-name">LC_ALL</span>=C ccache  -O3 -DNDEBUG -xc++ -E -v /dev/null 2&gt;&amp;1 &gt;/dev/null | awk <span class="org-string">'/^#include &lt;/,/^End of search/{if (!/^#include &lt;/ &amp;&amp; !/^End of search/){ print }}'</span> | <span class="org-variable-name">GREP_OPTIONS</span>= grep -E <span class="org-string">"(c|g)\+\+"</span>
Results was:
With exit code 256

Processing ublas.C...
Running vecOperation1
---------------------
vec1 = [5](1,1,1,1,1)
vec1 = [5](1,2.4,3.5,-5,1)
<span class="org-function-name">sum</span>(vec1) = 2.9
<span class="org-function-name">norm_1</span>(vec1) = 12.9
<span class="org-function-name">norm_2</span>(vec1) = 6.70895
<span class="org-function-name">norm_inf</span>(vec1) = 5
<span class="org-function-name">index_norm_inf</span>(vec1) = 3

Running vecOperation2
---------------------
vec1 = [3](2.2,2.2,-5.1)
<span class="org-function-name">vec1.size</span>() = 3
vec2 = [3](-1.2,-1.2,1.1)
<span class="org-function-name">vec2.size</span>() = 3
<span class="org-function-name">inner_prod</span>(vec1, vec2) = -10.89
vec1 + vec2 = [3](1,1,-4)
vec1 - vec2 = [3](3.4,3.4,-6.2)
vec1 * factor = [3](5.5,5.5,-12.75)
vec1 / factor = [3](0.88,0.88,-2.04)

Running matrixOperation1
------------------------
matrix1      = [3,3]((1,2.5,-3.5),(2.5,2.5,2.5),(5.9,2.5,1))
Num of rows  = 3
Num of cols  = 3
Transpose    = [3,3]((1,2.5,5.9),(2.5,2.5,2.5),(-3.5,2.5,1))
Real part    = [3,3]((1,2.5,-3.5),(2.5,2.5,2.5),(5.9,2.5,1))
Matrix resized = matrix1.resize(4, 4) = [4,4]((1,2.5,-3.5,2.93415e+59),(2.5,2.5,2.5,1.10542e+161),(5.9,2.5,1,9.83212e-72),(1.41746e+190,5.16752e+25,6.32283e+233,6.94321e-307))
identity_matrix&lt;double&gt;(3) = [3,3]((1,0,0),(0,1,0),(0,0,1))
zero_matrix&lt;double&gt;(3) = [3,3]((0,0,0),(0,0,0),(0,0,0))
</pre>
</div>
</div>
</div>
