Root-cern-repl.org
*** Example: GNU Scientific Library C++ Wrapper Script 

File: script1.C

#+BEGIN_SRC cpp 
  /** 
   ,*  Reference: 
   ,*   + https://root-forum.cern.ch/t/loading-a-library-from-a-script/24306
   ,**/
  #include <iostream>
  #include <iomanip>
  #include <functional>
  #include <cmath>
  #include <ostream>

  // Install GNU Scientific Library on Fedora with:
  // $ sudo dnf install gsl-devel.x86_64
  #include <gsl/gsl_sf_bessel.h>
  #include <gsl/gsl_errno.h>
  #include <gsl/gsl_math.h>
  #include <gsl/gsl_roots.h>

  // Load Shared libraries needed by the script
  #ifdef  __CLING__
    R__LOAD_LIBRARY(/lib64/libgslcblas.so.0);
    R__LOAD_LIBRARY(/lib64/libgsl.so);
  #endif 

  namespace GSL{
          using MFun = std::function<double (double)>;
	
          double wrapLambda(double x, void* param){
                  auto fp = static_cast<MFun*>(param);
                  return fp->operator()(x);
          }

  /**  
    ,* Note: In order to to not throw the error:  <ERROR: endpoints do not straddle y=0>
    ,* mf(xa) * mf(xb) < 0 the function must have opposite signals at the interval bounds.
    ,*/
          double rootSolverBracket(
                  // gsl_root_fsolver_type* solvertype,
                  MFun   mf,
                  double xa,
                  double xb,
                  int    maxIteratiosn = 100,
                  double tol = 1e-5
                  ){
                  gsl_function fnt;
                  fnt.function = wrapLambda;
                  fnt.params   = &mf;

                  gsl_root_fsolver *solver;
                  solver = gsl_root_fsolver_alloc(gsl_root_fsolver_bisection);
                  //solver = gsl_root_fsolver_alloc(solvertype);  
                  // dbgtrace("Setting solver");
                  gsl_root_fsolver_set(solver, &fnt, xa, xb);
                  // dbgtrace("Solver set OK");
                  // gsl_root_fsolver_iterate(solver);
                  // dbgtrace("Solver initial iteration OK");
                  int status = GSL_CONTINUE;
                  int  i = 0;
                  double root;
                  double xlo, xhi;
                  // dbgtrace("In the solver loop");
                  while(i <= maxIteratiosn && status == GSL_CONTINUE){
                          // dbgtrace("Iterating solver");
                          status = gsl_root_fsolver_iterate(solver);
                          // disp(status);
                          if(status != GSL_SUCCESS)
                                  break;
                          root = gsl_root_fsolver_root(solver);
                          // disp(root);
                          xlo = gsl_root_fsolver_x_lower(solver);
                          xhi = gsl_root_fsolver_x_upper(solver);
                          status = gsl_root_test_interval(xlo, xhi, 0, tol);
                          // if(status == GSL_SUCCESS)
                          //  std::cerr << "Converged" << std::endl;          
                          i++;
                  }
                  gsl_root_fsolver_free(solver);
                  if(status == GSL_SUCCESS)
                          return root;
                  else
                          return std::numeric_limits<double>::signaling_NaN();;   
                  return 0;
          }
	
  }

  /** Equation "functor" - function-object */
  struct EquationTest{
      double A;
      double B;
      EquationTest(double a, double b): A(a), B(b) {};
      /* Computes: A * x^2 - B * sin(x) */
      double operator()(double x){
          return A * x * x * x - B * sin(x);
      }
  };
	
  /** Script entry-point should have the same name as the file. */
  void script1(){

    if(__cplusplus >= 201703L)
      std::cout << "Running C++17" << "\n";
    else if(__cplusplus >= 201402L)
      std::cout << "Running C++14" << "\n";
    else if(__cplusplus >= 201103L)
      std::cout << "Running C++11" << "\n";
  
    std::cout << "Running a C++ script in the ROOT REPL. " << "\n";

    std::cout << " gsl_sf_bessel_J0(4.0) = "
              << gsl_sf_bessel_J0(4.0) << "\n";

    double root = GSL::rootSolverBracket(
          // gsl_root_fsolver_bisection,
          [](double x){ return x * x - 25.0 ;}
          , -4, +10, 200
          );
     std::cout << "Root of equation x^2 - 25.0 =  " << root << "\n";      

     auto eqn = EquationTest(1.0, 4.0);  
     double root2 = GSL::rootSolverBracket(eqn, -10, +5, 200);
     std::cout << "Root of equation x^3 - 4 * sin(x) =  " << root2 << "\n"; 

  } //--- End of script1 ---//

  /** Main was added to allow compiling the script */
  int main(){
          script1();
          return 0;
  }

#+END_SRC

To run the script in the ROOT/CLING REPL use: 

#+BEGIN_SRC sh 
  $ root 
  >> .x script1.C
  Running C++11
  Running a C++ script in the ROOT REPL. 
   gsl_sf_bessel_J0(4.0) = -0.39715
  Root of equation x^2 - 25.0 =  5.00001
  Root of equation x^3 - 4 * sin(x) =  1.58732
  >> 
#+END_SRC

Load the script, play and prototype with it.

#+BEGIN_SRC cpp 
  >> .L script1.C
  >> 
  >> script1()
  Running C++11
  Running a C++ script in the ROOT REPL. 
   gsl_sf_bessel_J0(4.0) = -0.39715
  Root of equation x^2 - 25.0 =  5.00001
  Root of equation x^3 - 4 * sin(x) =  1.58732
  >> 

  >> GSL::
  rootSolverBracket
  wrapLambda
  >> 
  >> double x = 1.58732
  (double) 1.5873200
  >> pow(x, 3) - 4 * sin(x)
  (double) -6.6632073e-05
  >> 

  >> GSL::rootSolverBracket([](double x){ return x * x * x - 4 * sin(x);}, -10, 5, 200)
  (double) 1.5873218
  >> 

#+END_SRC

Run the script in batch mode: 

 - $ root -l -q script1.C

#+BEGIN_SRC sh 
  $ time cern-root -l -q script1.C

  Processing script1.C...
  Running C++11
  Running a C++ script in the ROOT REPL. 
   gsl_sf_bessel_J0(4.0) = -0.39715
  Root of equation x^2 - 25.0 =  5.00001
  Root of equation x^3 - 4 * sin(x) =  1.58732

  real	0m0.469s
  user	0m0.335s
  sys	0m0.096s
#+END_SRC

Compile the script: 

#+BEGIN_SRC sh 
  $ clang++ -std=c++1z script1.C -o script1.bin   -Wall -Wextra -g -lgsl -lgslcblas 

  $ ./script1.bin 
  Running C++17
  Running a C++ script in the ROOT REPL. 
   gsl_sf_bessel_J0(4.0) = -0.39715
  Root of equation x^2 - 25.0 =  5.00001
  Root of equation x^3 - 4 * sin(x) =  1.58732

#+END_SRC

How to extract the shared libraries needed to run the program?

#+BEGIN_SRC sh
  $ ldd script1.bin 
          linux-vdso.so.1 (0x00007ffe0f5b8000)
          libgsl.so.23 => /lib64/libgsl.so.23 (0x00007fcae26ca000)
          libgslcblas.so.0 => /lib64/libgslcblas.so.0 (0x00007fcae248b000)
          libstdc++.so.6 => /lib64/libstdc++.so.6 (0x00007fcae20f9000)
          libm.so.6 => /lib64/libm.so.6 (0x00007fcae1d65000)
          libgcc_s.so.1 => /lib64/libgcc_s.so.1 (0x00007fcae1b4d000)
          libc.so.6 => /lib64/libc.so.6 (0x00007fcae178e000)
          /lib64/ld-linux-x86-64.so.2 (0x00007fcae2b39000)

#+END_SRC

