Root-cern-repl.html
<div id="outline-container-org288d320" class="outline-4">
<h4 id="org288d320"><span class="section-number-4">1.5.2</span> Example: GNU Scientific Library C++ Wrapper Script</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
File: script1.C
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/** </span>
<span class="org-comment"> *  Reference: </span>
<span class="org-comment"> *   + https://root-forum.cern.ch/t/loading-a-library-from-a-script/24306</span>
<span class="org-comment"> **/</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iomanip</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">functional</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">cmath</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">ostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Install GNU Scientific Library on Fedora with:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">$ sudo dnf install gsl-devel.x86_64</span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_sf_bessel.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_errno.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_math.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">gsl/gsl_roots.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Load Shared libraries needed by the script</span>
<span class="org-preprocessor">#ifdef</span>  __CLING__
  R__LOAD_LIBRARY<span class="org-rainbow-delimiters-depth-1">(</span>/lib64/libgslcblas.so.0<span class="org-rainbow-delimiters-depth-1">)</span>;
  R__LOAD_LIBRARY<span class="org-rainbow-delimiters-depth-1">(</span>/lib64/libgsl.so<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-preprocessor">#endif</span> 

<span class="org-keyword">namespace</span> <span class="org-constant">GSL</span><span class="org-rainbow-delimiters-depth-1">{</span>
        <span class="org-keyword">using</span> <span class="org-type">MFun</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">double</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>;

        <span class="org-type">double</span> <span class="org-function-name">wrapLambda</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span>, <span class="org-type">void</span>* <span class="org-variable-name">param</span><span class="org-rainbow-delimiters-depth-2">){</span>
                <span class="org-keyword">auto</span> <span class="org-variable-name">fp</span> = <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">MFun</span>*<span class="org-rainbow-delimiters-depth-3">&gt;(</span>param<span class="org-rainbow-delimiters-depth-3">)</span>;
                <span class="org-keyword">return</span> fp-&gt;<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-3">()(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-comment-delimiter">/**  </span>
<span class="org-comment">  * Note: In order to to not throw the error:  &lt;ERROR: endpoints do not straddle y=0&gt;</span>
<span class="org-comment">  * mf(xa) * mf(xb) &lt; 0 the function must have opposite signals at the interval bounds.</span>
<span class="org-comment">  */</span>
        <span class="org-type">double</span> <span class="org-function-name">rootSolverBracket</span><span class="org-rainbow-delimiters-depth-2">(</span>
                <span class="org-comment-delimiter">// </span><span class="org-comment">gsl_root_fsolver_type* solvertype,</span>
                <span class="org-type">MFun</span>   <span class="org-variable-name">mf</span>,
                <span class="org-type">double</span> <span class="org-variable-name">xa</span>,
                <span class="org-type">double</span> <span class="org-variable-name">xb</span>,
                <span class="org-type">int</span>    <span class="org-variable-name">maxIteratiosn</span> = 100,
                <span class="org-type">double</span> <span class="org-variable-name">tol</span> = 1e-5
                <span class="org-rainbow-delimiters-depth-2">){</span>
                <span class="org-type">gsl_function</span> <span class="org-variable-name">fnt</span>;
                fnt.function = wrapLambda;
                fnt.params   = &amp;mf;

                <span class="org-type">gsl_root_fsolver</span> *<span class="org-variable-name">solver</span>;
                solver = gsl_root_fsolver_alloc<span class="org-rainbow-delimiters-depth-3">(</span>gsl_root_fsolver_bisection<span class="org-rainbow-delimiters-depth-3">)</span>;
                <span class="org-comment-delimiter">//</span><span class="org-comment">solver = gsl_root_fsolver_alloc(solvertype);  </span>
                <span class="org-comment-delimiter">// </span><span class="org-comment">dbgtrace("Setting solver");</span>
                gsl_root_fsolver_set<span class="org-rainbow-delimiters-depth-3">(</span>solver, &amp;fnt, xa, xb<span class="org-rainbow-delimiters-depth-3">)</span>;
                <span class="org-comment-delimiter">// </span><span class="org-comment">dbgtrace("Solver set OK");</span>
                <span class="org-comment-delimiter">// </span><span class="org-comment">gsl_root_fsolver_iterate(solver);</span>
                <span class="org-comment-delimiter">// </span><span class="org-comment">dbgtrace("Solver initial iteration OK");</span>
                <span class="org-type">int</span> <span class="org-variable-name">status</span> = GSL_CONTINUE;
                <span class="org-type">int</span>  <span class="org-variable-name">i</span> = 0;
                <span class="org-type">double</span> <span class="org-variable-name">root</span>;
                <span class="org-type">double</span> <span class="org-variable-name">xlo</span>, <span class="org-variable-name">xhi</span>;
                <span class="org-comment-delimiter">// </span><span class="org-comment">dbgtrace("In the solver loop");</span>
                <span class="org-keyword">while</span><span class="org-rainbow-delimiters-depth-3">(</span>i &lt;= maxIteratiosn &amp;&amp; status == GSL_CONTINUE<span class="org-rainbow-delimiters-depth-3">){</span>
                        <span class="org-comment-delimiter">// </span><span class="org-comment">dbgtrace("Iterating solver");</span>
                        status = gsl_root_fsolver_iterate<span class="org-rainbow-delimiters-depth-4">(</span>solver<span class="org-rainbow-delimiters-depth-4">)</span>;
                        <span class="org-comment-delimiter">// </span><span class="org-comment">disp(status);</span>
                        <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-4">(</span>status != GSL_SUCCESS<span class="org-rainbow-delimiters-depth-4">)</span>
                                <span class="org-keyword">break</span>;
                        root = gsl_root_fsolver_root<span class="org-rainbow-delimiters-depth-4">(</span>solver<span class="org-rainbow-delimiters-depth-4">)</span>;
                        <span class="org-comment-delimiter">// </span><span class="org-comment">disp(root);</span>
                        xlo = gsl_root_fsolver_x_lower<span class="org-rainbow-delimiters-depth-4">(</span>solver<span class="org-rainbow-delimiters-depth-4">)</span>;
                        xhi = gsl_root_fsolver_x_upper<span class="org-rainbow-delimiters-depth-4">(</span>solver<span class="org-rainbow-delimiters-depth-4">)</span>;
                        status = gsl_root_test_interval<span class="org-rainbow-delimiters-depth-4">(</span>xlo, xhi, 0, tol<span class="org-rainbow-delimiters-depth-4">)</span>;
                        <span class="org-comment-delimiter">// </span><span class="org-comment">if(status == GSL_SUCCESS)</span>
                        <span class="org-comment-delimiter">//  </span><span class="org-comment">std::cerr &lt;&lt; "Converged" &lt;&lt; std::endl;          </span>
                        i++;
                <span class="org-rainbow-delimiters-depth-3">}</span>
                gsl_root_fsolver_free<span class="org-rainbow-delimiters-depth-3">(</span>solver<span class="org-rainbow-delimiters-depth-3">)</span>;
                <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-3">(</span>status == GSL_SUCCESS<span class="org-rainbow-delimiters-depth-3">)</span>
                        <span class="org-keyword">return</span> root;
                <span class="org-keyword">else</span>
                        <span class="org-keyword">return</span> <span class="org-constant">std</span>::<span class="org-constant">numeric_limits</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>::signaling_NaN<span class="org-rainbow-delimiters-depth-3">()</span>;;   
                <span class="org-keyword">return</span> 0;
        <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Equation "functor" - function-object */</span>
<span class="org-keyword">struct</span> <span class="org-type">EquationTest</span><span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-type">double</span> <span class="org-variable-name">A</span>;
    <span class="org-type">double</span> <span class="org-variable-name">B</span>;
    <span class="org-function-name">EquationTest</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span><span class="org-rainbow-delimiters-depth-2">)</span>: A<span class="org-rainbow-delimiters-depth-2">(</span>a<span class="org-rainbow-delimiters-depth-2">)</span>, B<span class="org-rainbow-delimiters-depth-2">(</span>b<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>;
    <span class="org-comment-delimiter">/* </span><span class="org-comment">Computes: A * x^2 - B * sin(x) */</span>
    <span class="org-type">double</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span>
        <span class="org-keyword">return</span> A * x * x * x - B * sin<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Script entry-point should have the same name as the file. */</span>
<span class="org-type">void</span> <span class="org-function-name">script1</span><span class="org-rainbow-delimiters-depth-1">(){</span>

  <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>__cplusplus &gt;= 201703L<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Running C++17"</span> &lt;&lt; <span class="org-string">"\n"</span>;
  <span class="org-keyword">else</span> <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>__cplusplus &gt;= 201402L<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Running C++14"</span> &lt;&lt; <span class="org-string">"\n"</span>;
  <span class="org-keyword">else</span> <span class="org-keyword">if</span><span class="org-rainbow-delimiters-depth-2">(</span>__cplusplus &gt;= 201103L<span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Running C++11"</span> &lt;&lt; <span class="org-string">"\n"</span>;

  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Running a C++ script in the ROOT REPL. "</span> &lt;&lt; <span class="org-string">"\n"</span>;

  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">" gsl_sf_bessel_J0(4.0) = "</span>
            &lt;&lt; gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-2">(</span>4.0<span class="org-rainbow-delimiters-depth-2">)</span> &lt;&lt; <span class="org-string">"\n"</span>;

  <span class="org-type">double</span> <span class="org-variable-name">root</span> = <span class="org-constant">GSL</span>::rootSolverBracket<span class="org-rainbow-delimiters-depth-2">(</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">gsl_root_fsolver_bisection,</span>
        <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-3">){</span> <span class="org-keyword">return</span> x * x - 25.0 ;<span class="org-rainbow-delimiters-depth-3">}</span>
        , -4, +10, 200
        <span class="org-rainbow-delimiters-depth-2">)</span>;
   <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Root of equation x^2 - 25.0 =  "</span> &lt;&lt; root &lt;&lt; <span class="org-string">"\n"</span>;      

   <span class="org-keyword">auto</span> <span class="org-variable-name">eqn</span> = EquationTest<span class="org-rainbow-delimiters-depth-2">(</span>1.0, 4.0<span class="org-rainbow-delimiters-depth-2">)</span>;  
   <span class="org-type">double</span> <span class="org-variable-name">root2</span> = <span class="org-constant">GSL</span>::rootSolverBracket<span class="org-rainbow-delimiters-depth-2">(</span>eqn, -10, +5, 200<span class="org-rainbow-delimiters-depth-2">)</span>;
   <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Root of equation x^3 - 4 * sin(x) =  "</span> &lt;&lt; root2 &lt;&lt; <span class="org-string">"\n"</span>; 

<span class="org-rainbow-delimiters-depth-1">}</span> <span class="org-comment-delimiter">//</span><span class="org-comment">--- End of script1 ---//</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Main was added to allow compiling the script */</span>
<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(){</span>
        script1<span class="org-rainbow-delimiters-depth-2">()</span>;
        <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
To run the script in the ROOT/CLING REPL use: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ root 
&gt;&gt; .x script1.C
Running C++11
Running a C++ script<span class="org-keyword"> in</span> the ROOT REPL. 
 gsl_sf_bessel_J0(4.0) = -0.39715
Root of equation x^2 - 25.0 =  5.00001
Root of equation x^3 - 4 * sin(x) =  1.58732
&gt;&gt; 
</pre>
</div>

<p>
Load the script, play and prototype with it.
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; .L script1.C
&gt;&gt; 
&gt;&gt; script1<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-type">Running</span> <span class="org-variable-name">C</span>++11
Running a C++ script in the ROOT REPL. 
 gsl_sf_bessel_J0<span class="org-rainbow-delimiters-depth-1">(</span>4.0<span class="org-rainbow-delimiters-depth-1">)</span> = -0.39715
Root of equation x^2 - 25.0 =  5.00001
Root of equation x^3 - 4 * sin<span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span> =  1.58732
&gt;&gt; 

&gt;&gt; <span class="org-constant">GSL</span>::
rootSolverBracket
wrapLambda
&gt;&gt; 
&gt;&gt; <span class="org-type">double</span> x = 1.58732
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 1.5873200
&gt;&gt; pow<span class="org-rainbow-delimiters-depth-1">(</span>x, 3<span class="org-rainbow-delimiters-depth-1">)</span> - 4 * sin<span class="org-rainbow-delimiters-depth-1">(</span>x<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> -6.6632073e-05
&gt;&gt; 

&gt;&gt; <span class="org-constant">GSL</span>::rootSolverBracket<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">double</span> <span class="org-variable-name">x</span><span class="org-rainbow-delimiters-depth-2">){</span> <span class="org-keyword">return</span> x * x * x - 4 * sin<span class="org-rainbow-delimiters-depth-3">(</span>x<span class="org-rainbow-delimiters-depth-3">)</span>;<span class="org-rainbow-delimiters-depth-2">}</span>, -10, 5, 200<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">double</span><span class="org-rainbow-delimiters-depth-1">)</span> 1.5873218
&gt;&gt; 

</pre>
</div>

<p>
Run the script in batch mode: 
</p>

<ul class="org-ul">
<li>$ root -l -q script1.C</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">$ time cern-root -l -q script1.C

Processing script1.C...
Running C++11
Running a C++ script<span class="org-keyword"> in</span> the ROOT REPL. 
 gsl_sf_bessel_J0(4.0) = -0.39715
Root of equation x^2 - 25.0 =  5.00001
Root of equation x^3 - 4 * sin(x) =  1.58732

real    0m0.469s
user    0m0.335s
sys     0m0.096s
</pre>
</div>

<p>
Compile the script: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ clang++ -std=c++1z script1.C -o <span class="org-keyword">script1.bin</span>   -Wall -Wextra -g -lgsl -lgslcblas 

$ ./script1.bin 
Running C++17
Running a C++ script<span class="org-keyword"> in</span> the ROOT REPL. 
 gsl_sf_bessel_J0(4.0) = -0.39715
Root of equation x^2 - 25.0 =  5.00001
Root of equation x^3 - 4 * sin(x) =  1.58732

</pre>
</div>

<p>
How to extract the shared libraries needed to run the program?
</p>

<div class="org-src-container">
<pre class="src src-sh">$ ldd script1.bin 
        linux-vdso.so.1 (0x00007ffe0f5b8000)
        libgsl.so.23 =&gt; /lib64/libgsl.so.23 (0x00007fcae26ca000)
        libgslcblas.so.0 =&gt; /lib64/libgslcblas.so.0 (0x00007fcae248b000)
        libstdc++.so.6 =&gt; /lib64/libstdc++.so.6 (0x00007fcae20f9000)
        libm.so.6 =&gt; /lib64/libm.so.6 (0x00007fcae1d65000)
        libgcc_s.so.1 =&gt; /lib64/libgcc_s.so.1 (0x00007fcae1b4d000)
        libc.so.6 =&gt; /lib64/libc.so.6 (0x00007fcae178e000)
        /lib64/ld-linux-x86-64.so.2 (0x00007fcae2b39000)

</pre>
</div>
</div>
</div>
</div>
