Root-cern-repl.html

<div id="outline-container-org4eb2742" class="outline-3">
<h3 id="org4eb2742"><span class="section-number-3">1.6</span> Load Python3 (CPython) C-API in the REPL</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Install Python 3 development libraries: (Fedora Linux)
</p>

<div class="org-src-container">
<pre class="src src-sh">$ sudo dnf install python3-devel.x86_64
</pre>
</div>

<p>
Locate where is Python3 shared library: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ ldd $(<span class="org-sh-quoted-exec">which</span> python3)
        linux-vdso.so.1 (0x00007fff82b64000)
        libpython3.6m.so.1.0 =&gt; /lib64/libpython3.6m.so.1.0 (0x00007fd1eb4a5000)
        libpthread.so.0 =&gt; /lib64/libpthread.so.0 (0x00007fd1eb286000)
        libdl.so.2 =&gt; /lib64/libdl.so.2 (0x00007fd1eb082000)
        libutil.so.1 =&gt; /lib64/libutil.so.1 (0x00007fd1eae7f000)
        libm.so.6 =&gt; /lib64/libm.so.6 (0x00007fd1eaaeb000)
        libc.so.6 =&gt; /lib64/libc.so.6 (0x00007fd1ea72c000)
        /lib64/ld-linux-x86-64.so.2 (0x00007fd1ebc04000)

 $ ldd $(<span class="org-sh-quoted-exec">which</span> python3) | grep python
         libpython3.6m.so.1.0 =&gt; /lib64/libpython3.6m.so.1.0 (0x00007ff0015ee000)
</pre>
</div>

<p>
Locate Python 3 header files: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ find /usr/include/ -name <span class="org-string">"Python.h"</span>
/usr/include/python3.6m/Python.h
</pre>
</div>

<p>
Start ROOT REPL: 
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cern-root
 ==&gt; Starting root configuration from: /home/archbox/.rootalias.C
Current dir = /home/archbox/Documents/projects/cpp-programming.cpp/src
(std::basic_ostream&lt;char, std::char_traits&lt;char&gt; &gt;::__ostream_type &amp;) @0x7fb42fc7eec0
</pre>
</div>

<p>
Load the Python3 shared library and its header file: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; #include <span class="org-string">"python3.6m/Python.h"</span>
&gt;&gt; #pragma cling load<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"/lib64/libpython3.6m.so.1.0"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Initialize Python3:
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_Initialize<span class="org-rainbow-delimiters-depth-1">()</span>;
</pre>
</div>

<p>
Python C-API Py_GetPath():
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_GetPath<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">wchar_t</span> *<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fff9a144968

&gt;&gt; <span class="org-constant">std</span>::wcout &lt;&lt; <span class="org-string">"path = "</span> &lt;&lt; Py_GetPath<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; L<span class="org-string">"\n"</span>;
path = /usr/lib64/python36.zip:/usr/lib64/python3.6:/usr/lib64/python3.6:/usr/lib64/python3.6/lib-dynload
&gt;&gt; 
</pre>
</div>

<p>
Get Version: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_GetVersion<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-warning">"</span><span class="org-string">3.6.7 (default, Nov 23 2018, 12:11:28) </span>
<span class="org-string">[GCC 8.2.1 20181105 (Red Hat 8.2.1-5)]"</span>
</pre>
</div>

<p>
Get Platform: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_GetPlatform<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-string">"linux"</span>
</pre>
</div>

<p>
Information about Python interpreter:
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_GetPrefix<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">wchar_t</span> *<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fff9a144968

&gt;&gt; <span class="org-constant">std</span>::wcout &lt;&lt; L<span class="org-string">" =&gt; Py_GetPrefix() = "</span> &lt;&lt; Py_GetPrefix<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; L<span class="org-string">"\n"</span>;
 =&gt; Py_GetPrefix<span class="org-rainbow-delimiters-depth-1">()</span> = /usr

&gt;&gt; Py_GetProgramFullPath<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">wchar_t</span> *<span class="org-rainbow-delimiters-depth-1">)</span> @0x7fff9a144968

&gt;&gt; <span class="org-constant">std</span>::wcout &lt;&lt; L<span class="org-string">" =&gt; Py_GetProgramFullPath() = "</span> &lt;&lt; Py_GetProgramFullPath<span class="org-rainbow-delimiters-depth-1">()</span> &lt;&lt; L<span class="org-string">"\n"</span>;
 =&gt; Py_GetProgramFullPath<span class="org-rainbow-delimiters-depth-1">()</span> = /usr/bin/python3
</pre>
</div>

<p>
Get copyright banner: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_GetCopyright<span class="org-rainbow-delimiters-depth-1">()</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-warning">"</span><span class="org-string">Copyright (c) 2001-2018 Python Software Foundation.</span>
<span class="org-string">All Rights Reserved.</span>

<span class="org-string">Copyright (c) 2000 BeOpen.com.</span>
<span class="org-string">All Rights Reserved.</span>

<span class="org-string">Copyright (c) 1995-2001 Corporation for National Research Initiatives.</span>
<span class="org-string">All Rights Reserved.</span>

<span class="org-string">Copyright (c) 1991-1995 Stichting Mathematisch Centrum, Amsterdam.</span>
<span class="org-string">All Rights Reserved."</span>
&gt;&gt; 
</pre>
</div>

<p>
Python C-API PyRun_SimpleString: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; PyRun_SimpleString<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"print(' ==&gt;&gt; Hello world Python3')"</span><span class="org-rainbow-delimiters-depth-1">)</span>
 ==&gt;&gt; Hello world Python3
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0
&gt;&gt; 

&gt;&gt; PyRun_SimpleString<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"print(m.sin(m.pi))"</span><span class="org-rainbow-delimiters-depth-1">)</span>
1.2246467991473532e-16
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0

&gt;&gt; PyRun_SimpleString<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"print(m.cos(m.pi))"</span><span class="org-rainbow-delimiters-depth-1">)</span>
-1.0
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0

&gt;&gt; PyRun_SimpleString<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"print(m.exp(2.5))"</span><span class="org-rainbow-delimiters-depth-1">)</span>
12.182493960703473
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> 0

&gt;&gt; PyRun_SimpleString<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"print(wrong(2.5))"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-function-name">Traceback</span> <span class="org-rainbow-delimiters-depth-1">(</span>most recent <span class="org-type">call</span> <span class="org-variable-name">last</span><span class="org-rainbow-delimiters-depth-1">)</span>:
  File <span class="org-string">"&lt;string&gt;"</span>, line 1, <span class="org-type">in</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>module<span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-function-name">NameError</span>: name <span class="org-warning">'</span>wrong<span class="org-warning">'</span> is <span class="org-keyword">not</span> defined
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">)</span> -1
</pre>
</div>

<p>
Creating primitive python float point object:
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; PyObject* value = Py_BuildValue<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"f"</span>, 5.136<span class="org-rainbow-delimiters-depth-1">)</span>;

&gt;&gt; value
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb43059f240

&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>value, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
5.136
</pre>
</div>

<p>
Creating primitive python string object:
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; PyObject* pystring = Py_BuildValue<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"s"</span>, <span class="org-string">" Python3-C++-REPL"</span><span class="org-rainbow-delimiters-depth-1">)</span>;

&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>pystring, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-warning">'</span> Python3-C++-REPL<span class="org-warning">'</span>
</pre>
</div>

<p>
Importing module sys: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; PyObject* msys = PyImport_ImportModule<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"sys"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb430593ef8

&gt;&gt; PyObject* pyver = PyObject_GetAttrString<span class="org-rainbow-delimiters-depth-1">(</span>msys, <span class="org-string">"version"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb4305970b0
&gt;&gt; 

&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>pyver, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-warning">'</span>3.6.7 <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">default</span>, Nov 23 2018, 12:11:28<span class="org-rainbow-delimiters-depth-1">)</span> \n<span class="org-rainbow-delimiters-depth-1">[</span>GCC 8.2.1 20181105 <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">Red</span> <span class="org-variable-name">Hat</span> 8.2.1-5<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">]</span><span class="org-warning">'</span>
&gt;&gt; 


</pre>
</div>

<p>
Importing module math:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Equivalen to: import math </span>
&gt;&gt; PyObject* m = PyImport_ImportModule<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"math"</span><span class="org-rainbow-delimiters-depth-1">)</span>;

&gt;&gt; m
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb41b1b79f8
&gt;&gt; 

&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>m, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">&lt;</span>module <span class="org-warning">'</span>math<span class="org-warning">'</span> from <span class="org-warning">'</span>/usr/lib64/python3.6/lib-dynload/math.cpython-36m-x86_64-linux-gnu.so<span class="org-warning">'</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
</pre>
</div>

<p>
Get function sin from module <b>math</b>:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">// </span><span class="org-comment">Get function sin from module math </span>
&gt;&gt; PyObject* py_sin = PyObject_GetAttrString<span class="org-rainbow-delimiters-depth-1">(</span>m, <span class="org-string">"sin"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb41b1401f8

<span class="org-comment-delimiter">// </span><span class="org-comment">Print string representation of function 'sin'</span>
&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>py_sin, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">&lt;</span>built-in function sin<span class="org-rainbow-delimiters-depth-1">&gt;</span>
&gt;&gt; 
</pre>
</div>

<p>
Call funciton 'sin':
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; PyObject* args = Py_BuildValue<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"(f)"</span>, M_PI_2<span class="org-rainbow-delimiters-depth-1">)</span>;

&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>args, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">(</span>1.5707963267948966,<span class="org-rainbow-delimiters-depth-1">)</span>

&gt;&gt; PyObject* result = PyEval_CallObject<span class="org-rainbow-delimiters-depth-1">(</span>py_sin, args<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb43059f1e0

&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>result, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
1.0
</pre>
</div>


<p>
Creating a dictionary object or hash table object:
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; PyObject* dc = PyDict_New<span class="org-rainbow-delimiters-depth-1">()</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Heal-allocated object.</span>
&gt;&gt; dc
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">PyObject</span> *<span class="org-rainbow-delimiters-depth-1">)</span> 0x7fb41b234558
&gt;&gt; 

<span class="org-comment-delimiter">// </span><span class="org-comment">Print the string representation of the dictionary object</span>
&gt;&gt; PyObject_Print<span class="org-rainbow-delimiters-depth-1">(</span>dc, stdout, 0<span class="org-rainbow-delimiters-depth-1">)</span>, <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-constant">std</span>::endl;
<span class="org-rainbow-delimiters-depth-1">{}</span>
&gt;&gt; 
</pre>
</div>

<p>
Exit Python and quit REPL:
</p>

<div class="org-src-container">
<pre class="src src-cpp">&gt;&gt; Py_Finalize<span class="org-rainbow-delimiters-depth-1">()</span>
&gt;&gt; .q
</pre>
</div>


<p>
<b>Python C-API Objects:</b>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">C-API Object</th>
<th scope="col" class="org-left">C-function Constructor</th>
<th scope="col" class="org-left">Python Object</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PyObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Python ROOT object, all Python objects are an instance of PyObject</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyIntObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyLongObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyFloatObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyStringObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyDictObject</td>
<td class="org-left">PyDict_New</td>
<td class="org-left">Python dictionary {}</td>
</tr>

<tr>
<td class="org-left">PyTupleObject</td>
<td class="org-left">PyTuple_New</td>
<td class="org-left">Python tuple, example: (100, 200, "Location")</td>
</tr>

<tr>
<td class="org-left">PyListObject</td>
<td class="org-left">PyList_New</td>
<td class="org-left">Python list object, example: [100, 2000, 'x']</td>
</tr>

<tr>
<td class="org-left">PyVarObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyTypeObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyByteArrayObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyBytesObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PySetObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PyUnicodeObject</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Note: The C-function "constructors" return a pointer to PyObject or
PyObject* pointer.</li>
</ul>


<p>
<b>References:</b>
</p>

<ul class="org-ul">
<li><a href="https://docs.python.org/3/extending/index.html">Extending and Embedding the Python Interpreter — Python 3.7.2 documentation</a></li>

<li><a href="https://docs.python.org/3/c-api/structures.html">Common Object Structures — Python 3.7.2 documentation</a></li>

<li><a href="https://docs.scipy.org/doc/numpy/reference/c-api.types-and-structures.html">Python Types and C-Structures — NumPy v1.15 Manual</a></li>

<li><a href="https://docs.python.org/2.3/api/stringObjects.html">7.3.1 String Objects</a></li>

<li><a href="https://docs.python.org/2/c-api/code.html">Code Objects — Python 2.7.15 documentation</a></li>

<li><a href="https://docs.python.org/2/c-api/veryhigh.html#c.PyRun_SimpleFileExFlags">The Very High Level Layer — Python 2.7.15 documentation</a></li>

<li><a href="https://stackoverflow.com/questions/3789881/create-and-call-python-function-from-string-via-c-api">Create and call python function from string via C API - Stack Overflow</a></li>

<li><a href="https://www6.software.ibm.com/developerworks/education/l-pythonscript/l-pythonscript-ltr.pdf">Embed Python scripting in C applications</a></li>

<li><a href="https://stackoverflow.com/questions/4922365/python-c-api-pyeval-callfunction">Python C API: PyEval_CallFunction? - Stack Overflow</a></li>

<li><a href="http://effbot.org/pyfaq/how-do-i-call-an-object-s-method-from-c.htm">How do I call an object's method from C?</a></li>
</ul>

<p>
Creating a native Python module: 
</p>
<ul class="org-ul">
<li><a href="https://docs.microsoft.com/en-us/visualstudio/python/working-with-c-cpp-python-in-visual-studio?view=vs-2017">Write C++ extensions for Python - Visual Studio | Microsoft Docs</a></li>
<li><a href="http://yizhang82.me/python-interop-capi">Calling C functions from Python - part 2 - writing CPython extensions using Python/C API | yizhang82’s blog</a></li>
</ul>

<p>
Python (CPython) debugging with GDB:
</p>
<ul class="org-ul">
<li><a href="https://devguide.python.org/gdb/">22. gdb Support — Python Developer's Guide</a></li>
<li><a href="https://docs.microsoft.com/en-us/visualstudio/python/debugging-mixed-mode-c-cpp-python-in-visual-studio?view=vs-2017">Mixed-mode debugging for Python - Visual Studio | Microsoft Docs</a></li>
</ul>

<p>
Reverse engineering: 
</p>
<ul class="org-ul">
<li><a href="https://recon.cx/2008/a/aaron_portnoy-ali_rizvi_santiago/slides.pdf">Reverse Engineering Dynamic Languages - A Focus on Python</a></li>
</ul>
</div>
</div>
