Root-cern-repl.org
** Basic Commands 
*** Show Help 
 
 + Command: .?

#+BEGIN_SRC text 
Root [3] .?

 Cling (C/C++ interpreter) meta commands usage
 All commands must be preceded by a '.', except
 for the evaluation statement { }
 ==============================================================================
 Syntax: .Command [arg0 arg1 ... argN]

   .L <filename>		- Load the given file or library

   .(x|X) <filename>[args]	- Same as .L and runs a function with
				  signature: ret_type filename(args)

   .> <filename>		- Redirect command to a given file
      '>' or '1>'		- Redirects the stdout stream only
      '2>'			- Redirects the stderr stream only
      '&>' (or '2>&1')		- Redirects both stdout and stderr
      '>>'			- Appends to the given file

   .undo [n]			- Unloads the last 'n' inputs lines

   .U <filename>		- Unloads the given file

   .I [path]			- Shows the include path. If a path is given -
				  adds the path to the include paths

   .O <level>			- Sets the optimization level (0-3)
				  (not yet implemented)

   .class <name>		- Prints out class <name> in a CINT-like style

   .files 			- Prints out some CINT-like file statistics

   .fileEx 			- Prints out some file statistics

   .g 				- Prints out information about global variable
				  'name' - if no name is given, print them all

   .@ 				- Cancels and ignores the multiline input

   .rawInput [0|1]		- Toggle wrapping and printing the
				  execution results of the input

   .dynamicExtensions [0|1]	- Toggles the use of the dynamic scopes and the
				  late binding

   .printDebug [0|1]		- Toggles the printing of input's corresponding
				  state changes

   .storeState <filename>	- Store the interpreter's state to a given file

   .compareState <filename>	- Compare the interpreter's state with the one
				  saved in a given file

   .stats [name]		- Show stats for internal data structures
				  'ast'  abstract syntax tree stats
				  'asttree [filter]'  abstract syntax tree layout
				  'decl' dump ast declarations
				  'undo' show undo stack

   .help			- Shows this information

   .q				- Exit the program


#+END_SRC

** References and Bookmarks 

Download: 
 + https://root.cern.ch/content/release-61404

Documentation: 

 + [[https://root.cern.ch/cint][CINT | ROOT a Data analysis Framework]] 
 + [[https://www.slac.stanford.edu/BFROOT/www/doc/tutorials/19Jun2000_Root_Tutorial/ROOT_Tutorial.html][ROOT Tutorial Stanford]]
 + [[https://root.cern.ch/root/htmldoc/guides/users-guide/GettingStarted.html][Chapter: GettingStarted]]
 + [[http://www.t2.ucsd.edu/twiki2/bin/view/UCSDTier2/AnalysisTutorial][AnalysisTutorial < UCSDTier2 < TWiki]]
 + [[https://root.cern.ch/root/htmldoc/guides/users-guide/Cling.html][The C++ Interpreter Cling]]
 + 

Root Reflection Documentation: 
 + [[https://root.cern/doc/v612/namespaceROOT.html][ROOT: ROOT Namespace Reference]]

Questions: 
 + [[https://stackoverflow.com/questions/37671030/how-do-you-load-a-library-with-cling][c++ - How do you load a library with cling? - Stack Overflow]]

Files: 

 + *Scripting in the ROOT analysis Framework*
   + URL:  http://www.ftj.agh.edu.pl/~bold/scripts/wyklady/w5.pdf

 + *Introduction to ROOT Practical Session*
   + URL:  http://ific.uv.es/~fiorini/ROOTTutorial/root_tutorial.pdf

 + *A Root Guide for Beginners - Root Data Analysis Framework*
   + URL:   http://web.mit.edu/root_v6.12/ROOT-Primer.pdf
