Root-cern-repl.html
<div id="outline-container-orgc0e6548" class="outline-3">
<h3 id="orgc0e6548"><span class="section-number-3">1.7</span> Basic Commands</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orga2fc573" class="outline-4">
<h4 id="orga2fc573"><span class="section-number-4">1.7.1</span> Show Help</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li>Command: .?</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">Root [3] .?

 Cling (C/C++ interpreter) meta commands usage
 All commands must be preceded by a '.', except
 for the evaluation statement { }
 ==============================================================================
 Syntax: .Command [arg0 arg1 ... argN]

   .L &lt;filename&gt;                - Load the given file or library

   .(x|X) &lt;filename&gt;[args]      - Same as .L and runs a function with
                                  signature: ret_type filename(args)

   .&gt; &lt;filename&gt;                - Redirect command to a given file
      '&gt;' or '1&gt;'               - Redirects the stdout stream only
      '2&gt;'                      - Redirects the stderr stream only
      '&amp;&gt;' (or '2&gt;&amp;1')          - Redirects both stdout and stderr
      '&gt;&gt;'                      - Appends to the given file

   .undo [n]                    - Unloads the last 'n' inputs lines

   .U &lt;filename&gt;                - Unloads the given file

   .I [path]                    - Shows the include path. If a path is given -
                                  adds the path to the include paths

   .O &lt;level&gt;                   - Sets the optimization level (0-3)
                                  (not yet implemented)

   .class &lt;name&gt;                - Prints out class &lt;name&gt; in a CINT-like style

   .files                       - Prints out some CINT-like file statistics

   .fileEx                      - Prints out some file statistics

   .g                           - Prints out information about global variable
                                  'name' - if no name is given, print them all

   .@                           - Cancels and ignores the multiline input

   .rawInput [0|1]              - Toggle wrapping and printing the
                                  execution results of the input

   .dynamicExtensions [0|1]     - Toggles the use of the dynamic scopes and the
                                  late binding

   .printDebug [0|1]            - Toggles the printing of input's corresponding
                                  state changes

   .storeState &lt;filename&gt;       - Store the interpreter's state to a given file

   .compareState &lt;filename&gt;     - Compare the interpreter's state with the one
                                  saved in a given file

   .stats [name]                - Show stats for internal data structures
                                  'ast'  abstract syntax tree stats
                                  'asttree [filter]'  abstract syntax tree layout
                                  'decl' dump ast declarations
                                  'undo' show undo stack

   .help                        - Shows this information

   .q                           - Exit the program


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf2054d1" class="outline-3">
<h3 id="orgf2054d1"><span class="section-number-3">1.8</span> References and Bookmarks</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Download: 
</p>
<ul class="org-ul">
<li><a href="https://root.cern.ch/content/release-61404">https://root.cern.ch/content/release-61404</a></li>
</ul>

<p>
Documentation: 
</p>

<ul class="org-ul">
<li><a href="https://root.cern.ch/cint">CINT | ROOT a Data analysis Framework</a></li>
<li><a href="https://www.slac.stanford.edu/BFROOT/www/doc/tutorials/19Jun2000_Root_Tutorial/ROOT_Tutorial.html">ROOT Tutorial Stanford</a></li>
<li><a href="https://root.cern.ch/root/htmldoc/guides/users-guide/GettingStarted.html">Chapter: GettingStarted</a></li>
<li><a href="http://www.t2.ucsd.edu/twiki2/bin/view/UCSDTier2/AnalysisTutorial">AnalysisTutorial &lt; UCSDTier2 &lt; TWiki</a></li>
<li><a href="https://root.cern.ch/root/htmldoc/guides/users-guide/Cling.html">The C++ Interpreter Cling</a></li>
<li></li>
</ul>

<p>
Root Reflection Documentation: 
</p>
<ul class="org-ul">
<li><a href="https://root.cern/doc/v612/namespaceROOT.html">ROOT: ROOT Namespace Reference</a></li>
</ul>

<p>
Questions: 
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/37671030/how-do-you-load-a-library-with-cling">c++ - How do you load a library with cling? - Stack Overflow</a></li>
</ul>

<p>
Files: 
</p>

<ul class="org-ul">
<li><b>Scripting in the ROOT analysis Framework</b>
<ul class="org-ul">
<li>URL:  <a href="http://www.ftj.agh.edu.pl/~bold/scripts/wyklady/w5.pdf">http://www.ftj.agh.edu.pl/~bold/scripts/wyklady/w5.pdf</a></li>
</ul></li>

<li><b>Introduction to ROOT Practical Session</b>
<ul class="org-ul">
<li>URL:  <a href="http://ific.uv.es/~fiorini/ROOTTutorial/root_tutorial.pdf">http://ific.uv.es/~fiorini/ROOTTutorial/root_tutorial.pdf</a></li>
</ul></li>

<li><b>A Root Guide for Beginners - Root Data Analysis Framework</b>
<ul class="org-ul">
<li>URL:   <a href="http://web.mit.edu/root_v6.12/ROOT-Primer.pdf">http://web.mit.edu/root_v6.12/ROOT-Primer.pdf</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-03-06 Wed 14:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
